TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
/**
  ******************************************************************************
  * @file    stm32wlxx_app_radio.c
  * @brief   Handling of the radio driver app running on STM32WLxx MCU
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include <stdbool.h>

#include <assert.h>
#include <cmsis_compiler.h>
#include "stm32_rtos.h"

#include "stm32wlxx_app_radio.h"
#include "stm32wlxx_app_radio_default_timings.h"
#include "stm32wlxx_app_radio_hal.h"

#include <sid_error.h>
#include <sid_time_ops.h>
#include <sid_time_types.h>

#include <sid_pal_assert_ifc.h>
#include <sid_pal_critical_region_ifc.h>
#include <sid_pal_delay_ifc.h>
#include <sid_pal_log_ifc.h>
#include <sid_pal_uptime_ifc.h>

#include <comm_def.h>
#include <comm_opcodes.h>

#include <sid_stm32_common_utils.h>

#if SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT
#  include "main.h"
#endif

/* LPM handling */
#include "app_conf.h"
#if (CFG_LPM_LEVEL != 0)
#  include <stm32_lpm.h>
#endif /* (CFG_LPM_LEVEL != 0) */

/* Application version info */
#if defined(SID_APP_VERSION_HEADER)
#  include SID_APP_VERSION_HEADER
#else
#pragma message("SID_APP_VERSION_HEADER is not defined, application version info will remain empty when passed to the compatibility check callback (if defined)")
#endif /* SID_APP_VERSION_HEADER */

/* Private defines -----------------------------------------------------------*/

#define STM32WLxx_HANDSHAKE_ATTEMPTS_LIMIT           (5u)   /*!< Defines how many times in a row the driver will attempt to do a Handshake with the STM32WLxx side before the handshake error is reported */

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
#  define STM32WLxx_UDT_TASK_FLAG_INIT_DONE          (1u << 0u) /*!< UDT task notification flag to signal that the radio driver is initialized and fully operational */
#  define STM32WLxx_UDT_TASK_FLAG_UDT_ENABLED        (1u << 1u) /*!< UDT task notification flag to signal that UDT transfers are now enabled */
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

#define STM32WLxx_ANT_GAIN_CAP_REGION_NA             ((int32_t)(6 * 100)) /* Antenna gain (in dBi * 100) upper limit as per FCC requirements */

#define STM32WLxx_PA_CFG_PARAM_INVALID               (0xFFu) /*!< Indicates that PA config parameter is invalid */
#define STM32WLxx_PA_CFG_USE_LPA                     (0x01u) /*!< Use Low-Power Amplifier for Tx */
#define STM32WLxx_PA_CFG_USE_HPA                     (0x00u) /*!< Use High-Power Amplifier for Tx */
#define STM32WLxx_PA_CFG_LPA_OPTIMIZATION_14_DBM     (14)    /*!< LPA Tx power level for which an optimized PA config exists */
#define STM32WLxx_PA_CFG_LPA_OPTIMIZATION_10_DBM     (10)    /*!< LPA Tx power level for which an optimized PA config exists */
#define STM32WLxx_PA_CFG_HPA_OPTIMIZATION_20_DBM     (20)    /*!< HPA Tx power level for which an optimized PA config exists */
#define STM32WLxx_PA_CFG_HPA_OPTIMIZATION_17_DBM     (17)    /*!< HPA Tx power level for which an optimized PA config exists */
#define STM32WLxx_PA_CFG_HPA_OPTIMIZATION_14_DBM     (14)    /*!< HPA Tx power level for which an optimized PA config exists */


#define STM32WLxx_RADIO_ERROR_LIMIT                  (3u)    /*!< If the number of errors in a burst exceeds this limit the driver will reset the radio */
#define STM32WLxx_RADIO_ERROR_ASYM_INC_FACTOR        (2u)    /*!< Error counter will be incremented this times faster (and decremented always by 1). This asymmetric growth protects against the intermittent errors */

#define STM32WLxx_RADIO_LORA_UL_SEPARATION_US        (367000u) /*!< Uplink slot separation time for LoRa link */
#define STM32WLxx_RADIO_LORA_RX_TIMEOUT_US           (35000u) /*!< Timeout for LoRa Rx */

/* Private macros ------------------------------------------------------------*/

#ifndef STM32WLxx_RADIO_EXTRA_LOGGING
/* Set STM32WLxx_RADIO_EXTRA_LOGGING to 1 to enable extended logs */
#  define STM32WLxx_RADIO_EXTRA_LOGGING (0)
#endif

#if STM32WLxx_RADIO_EXTRA_LOGGING
#  define STM32WLxx_LOG_ERROR(...)   SID_PAL_LOG_ERROR(__VA_ARGS__)
#  define STM32WLxx_LOG_WARNING(...) SID_PAL_LOG_WARNING(__VA_ARGS__)
#  define STM32WLxx_LOG_INFO(...)    SID_PAL_LOG_INFO(__VA_ARGS__)
#  define STM32WLxx_LOG_DEBUG(...)   SID_PAL_LOG_DEBUG(__VA_ARGS__)
#  define STM32WLxx_LOG_TRACE(...)   SID_PAL_LOG_TRACE(__VA_ARGS__)
#else
#  define STM32WLxx_LOG_ERROR(...)   ((void)0u)
#  define STM32WLxx_LOG_WARNING(...) ((void)0u)
#  define STM32WLxx_LOG_INFO(...)    ((void)0u)
#  define STM32WLxx_LOG_DEBUG(...)   ((void)0u)
#  define STM32WLxx_LOG_TRACE(...)   ((void)0u)
#endif

/** This Macro implements compilation time comparison of types of two given variables.
 *  Reverse is done because standard implementation have problems comparing constant types in such a way
 */
#define STM32WLxx_COMPARE_CONST_TYPES(A,B) (_Generic( (A) , typeof(B): true, default: false) || _Generic( (B) , typeof(A): true, default: false))

/** This macro copies B to A comparing types during compilation in advance to avoid unexpected types change
 */
#define STM32WLxx_COPY_CFG_PARAM(A,B) static_assert(STM32WLxx_COMPARE_CONST_TYPES(A,B), "Types of copied fields should be same");\
                                      static_assert(sizeof(A)==sizeof(B), "Sizes of copied fields should be same");\
                                      (A)=(B);

/** This macro copies B to A comparing sizes during compilation in advance to avoid unexpected type size change
 *  Usage of this macro should be avoided. STM32WLxx_COPY_CFG_PARAM should be used instead
 */
#define STM32WLxx_COPY_CFG_PARAM_NO_TYPE_COMPARISON(A,B) static_assert(sizeof(A)==sizeof(B), "Sizes of copied fields should be same");\
                                                         SID_STM32_UTIL_fast_memcpy(A,B,sizeof(B));

/** This macro copies array B to A comparing types during compilation in advance to avoid unexpected types change
 */
#define STM32WLxx_COPY_CFG_ARRAY_PARAM(A,B) static_assert(STM32WLxx_COMPARE_CONST_TYPES(A[0],B[0]), "Types of copied fields should be same");\
                                            static_assert(sizeof(A)==sizeof(B), "Sizes of copied fields should be same");\
                                            SID_STM32_UTIL_fast_memcpy(A,B,sizeof(B));

/* Compare radio_fsk_fcs_t against stm32wlxx_radio_fsk_fcs_t */
static_assert((uint32_t)RADIO_FSK_FCS_TYPE_0 == (uint32_t)STM32WLxx_RADIO_FSK_FCS_TYPE_0);
static_assert((uint32_t)RADIO_FSK_FCS_TYPE_1 == (uint32_t)STM32WLxx_RADIO_FSK_FCS_TYPE_1);

/* Compare sid_pal_radio_events_t against stm32wlxx_pal_radio_events_t */
static_assert((uint32_t)SID_PAL_RADIO_EVENT_UNKNOWN      == (uint32_t)STM32WLxx_PAL_RADIO_EVENT_UNKNOWN);
static_assert((uint32_t)SID_PAL_RADIO_EVENT_TX_DONE      == (uint32_t)STM32WLxx_PAL_RADIO_EVENT_TX_DONE);
static_assert((uint32_t)SID_PAL_RADIO_EVENT_RX_DONE      == (uint32_t)STM32WLxx_PAL_RADIO_EVENT_RX_DONE);
static_assert((uint32_t)SID_PAL_RADIO_EVENT_CAD_DONE     == (uint32_t)STM32WLxx_PAL_RADIO_EVENT_CAD_DONE);
static_assert((uint32_t)SID_PAL_RADIO_EVENT_CAD_TIMEOUT  == (uint32_t)STM32WLxx_PAL_RADIO_EVENT_CAD_TIMEOUT);
static_assert((uint32_t)SID_PAL_RADIO_EVENT_RX_ERROR     == (uint32_t)STM32WLxx_PAL_RADIO_EVENT_RX_ERROR);
static_assert((uint32_t)SID_PAL_RADIO_EVENT_TX_TIMEOUT   == (uint32_t)STM32WLxx_PAL_RADIO_EVENT_TX_TIMEOUT);
static_assert((uint32_t)SID_PAL_RADIO_EVENT_RX_TIMEOUT   == (uint32_t)STM32WLxx_PAL_RADIO_EVENT_RX_TIMEOUT);
static_assert((uint32_t)SID_PAL_RADIO_EVENT_CS_DONE      == (uint32_t)STM32WLxx_PAL_RADIO_EVENT_CS_DONE);
static_assert((uint32_t)SID_PAL_RADIO_EVENT_CS_TIMEOUT   == (uint32_t)STM32WLxx_PAL_RADIO_EVENT_CS_TIMEOUT);
static_assert((uint32_t)SID_PAL_RADIO_EVENT_HEADER_ERROR == (uint32_t)STM32WLxx_PAL_RADIO_EVENT_HEADER_ERROR);
static_assert((uint32_t)SID_PAL_RADIO_EVENT_SYNC_DET     == (uint32_t)STM32WLxx_PAL_RADIO_EVENT_SYNC_DET);

/* Compare sid_pal_radio_cad_param_exit_mode_t against stm32wlxx_pal_radio_cad_param_exit_mode_t */
static_assert((uint32_t)SID_PAL_RADIO_CAD_EXIT_MODE_CS_ONLY == (uint32_t)STM32WLxx_RADIO_CAD_EXIT_MODE_CS_ONLY);
static_assert((uint32_t)SID_PAL_RADIO_CAD_EXIT_MODE_CS_RX   == (uint32_t)STM32WLxx_RADIO_CAD_EXIT_MODE_CS_RX);
static_assert((uint32_t)SID_PAL_RADIO_CAD_EXIT_MODE_CS_LBT  == (uint32_t)STM32WLxx_RADIO_CAD_EXIT_MODE_CS_LBT);
static_assert((uint32_t)SID_PAL_RADIO_CAD_EXIT_MODE_ED_ONLY == (uint32_t)STM32WLxx_RADIO_CAD_EXIT_MODE_ED_ONLY);
static_assert((uint32_t)SID_PAL_RADIO_CAD_EXIT_MODE_ED_RX   == (uint32_t)STM32WLxx_RADIO_CAD_EXIT_MODE_ED_RX);
static_assert((uint32_t)SID_PAL_RADIO_CAD_EXIT_MODE_ED_LBT  == (uint32_t)STM32WLxx_RADIO_CAD_EXIT_MODE_ED_LBT);
static_assert((uint32_t)SID_PAL_RADIO_CAD_EXIT_MODE_NONE    == (uint32_t)STM32WLxx_RADIO_CAD_EXIT_MODE_NONE);

