TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
/* Compare sid_pal_radio_lora_crc_present against stm32wlxx_pal_radio_lora_crc_present_t */
static_assert((uint32_t)SID_PAL_RADIO_CRC_PRESENT_INVALID == (uint32_t)STM32WLxx_PAL_RADIO_CRC_PRESENT_INVALID);
static_assert((uint32_t)SID_PAL_RADIO_CRC_PRESENT_OFF     == (uint32_t)STM32WLxx_PAL_RADIO_CRC_PRESENT_OFF);
static_assert((uint32_t)SID_PAL_RADIO_CRC_PRESENT_ON      == (uint32_t)STM32WLxx_PAL_RADIO_CRC_PRESENT_ON);
static_assert((uint32_t)SID_PAL_RADIO_CRC_PRESENT_MAX_NUM == (uint32_t)STM32WLxx_PAL_RADIO_CRC_PRESENT_MAX_NUM);

/* Private variables ---------------------------------------------------------*/

static halo_drv_stm32wlxx_ctx_t drv_ctx = {0};

/* Private constants ---------------------------------------------------------*/

static const osSemaphoreAttr_t wlxx_request_ack_lock_attributes = {
    .name       = "STM32WLxx Req Ack Semaphore",
    .attr_bits  = SEMAPHORE_DEFAULT_ATTR_BITS,
    .cb_mem     = SEMAPHORE_DEFAULT_CB_MEM,
    .cb_size    = SEMAPHORE_DEFAULT_CB_SIZE,
};

static const osSemaphoreAttr_t wlxx_irq_wait_lock_attributes = {
    .name       = "STM32WLxx IRQ Wait Semaphore",
    .attr_bits  = SEMAPHORE_DEFAULT_ATTR_BITS,
    .cb_mem     = SEMAPHORE_DEFAULT_CB_MEM,
    .cb_size    = SEMAPHORE_DEFAULT_CB_SIZE,
};

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
static const osThreadAttr_t wlxx_user_data_transfer_thread_attributes = {
    .name       = "STM32WLxx UDT Task",
    .priority   = STM32WLxx_RADIO_CFG_UDT_TASK_PRIO,
    .stack_size = STM32WLxx_RADIO_CFG_UDT_TASK_STACK_SIZE,
    .attr_bits  = TASK_DEFAULT_ATTR_BITS,
    .cb_mem     = TASK_DEFAULT_CB_MEM,
    .cb_size    = TASK_DEFAULT_CB_SIZE,
    .stack_mem  = TASK_DEFAULT_STACK_MEM,
};
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

/* Private function prototypes -----------------------------------------------*/

static inline int32_t  radio_stm32wlxx_platform_init(void);
static inline int32_t  radio_stm32wlxx_platform_deinit(void);
static        int32_t  radio_stm32wlxx_do_handshake(void);

static inline void     radio_stm32wlxx_pack_settings(const sid_pal_radio_fsk_phy_settings_t * const fsk_phy_cfg,
                                                     const sid_pal_radio_lora_phy_settings_t * const lora_phy_cfg,
                                                     stm32wlxx_radio_phy_cfg_t * const out_cfg);

static inline int32_t  radio_stm32wlxx_set_tx_power_config(const int8_t power);
static inline void     radio_stm32wlxx_error_manager(const int32_t reported_err, const uint32_t set_radio_sleep);

static inline int32_t  radio_stm32wlxx_get_adjusted_rssi(const int32_t raw_rssi);

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
static inline uint32_t _user_data_transfer_check_transfers_allowed(void);
static        void     _user_data_transfer_thread(void * context);
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

/* Private function definitions ----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline int32_t radio_stm32wlxx_platform_init(void)
{
    int32_t err = RADIO_ERROR_GENERIC;
    sid_error_t sid_err;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("radio_stm32wlxx_platform_init");

    do
    {
        /* Validate inputs */
        if (NULL == drv_ctx.config->pa_cfg_callback)
        {
            STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_init - null pa_cfg_callback!");
            err = RADIO_ERROR_INVALID_PARAMS;
            break;
        }

        /* Configure essential GPIO pins */
        hal_err = stm32wlxx_radio_hal_init_gpio(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_init - failed to configure essential GPIO. HAL error %u", hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Bring up SPI bus */
        sid_err = drv_ctx.config->bus_factory->create(&drv_ctx.bus_iface, drv_ctx.config->bus_factory->config);
        if ((sid_err != SID_ERROR_NONE) || (NULL == drv_ctx.bus_iface))
        {
            STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_init - error in bus_factory->create(). Error %d, iface: 0x%x", (int32_t)sid_err, drv_ctx.bus_iface);
            err = RADIO_ERROR_IO_ERROR;
            break;
        }

        /* Initialization is competed */
        STM32WLxx_LOG_DEBUG("radio_stm32wlxx_platform_init - done");
        err = RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline int32_t radio_stm32wlxx_platform_deinit(void)
{
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;
    sid_error_t sid_err;

    STM32WLxx_LOG_DEBUG("radio_stm32wlxx_platform_deinit");

    do
    {
        /* Deactivate IRQ pin */
        hal_err = stm32wlxx_hal_disarm_irq(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_deinit - error in stm32wlxx_hal_disarm_irq(). Error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Bring down SPI bus */
        const struct sid_pal_serial_bus_iface * const spi_bus_iface = drv_ctx.bus_iface;
        if (spi_bus_iface != NULL)
        {
            if (NULL == spi_bus_iface->destroy)
            {
                STM32WLxx_LOG_WARNING("radio_stm32wlxx_platform_deinit - spi_bus_iface has no destroy() method");
                err = RADIO_ERROR_NOT_SUPPORTED;
                break;
            }

            sid_err = spi_bus_iface->destroy(spi_bus_iface);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_deinit - error in spi_bus_iface->destroy(). Error %d", (int32_t)sid_err);
                err = RADIO_ERROR_IO_ERROR;
                break;
            }
        }
        else
        {
            SID_PAL_LOG_WARNING("radio_stm32wlxx_platform_deinit - SPI bus interface is null, bus deinitialization skipped");
        }

        /* Release GPIO pins */
        hal_err = stm32wlxx_radio_hal_deinit_gpio(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_deinit - failed to release GPIO. HAL error %u", hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Deinitialization is competed */
        STM32WLxx_LOG_DEBUG("radio_stm32wlxx_platform_deinit - done");
        err = RADIO_ERROR_NONE;
    } while (0);

