TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static int32_t radio_stm32wlxx_do_handshake(void)
{
    uint32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;
    stm32wlxx_rcp_irq_status_t irq_status;

    do
    {
        /* Perform GPIO handshake request */
        hal_err = stm32wlxx_hal_gpio_handshake_request(&drv_ctx);

        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("STM32WLxx GPIO handshaking failed. HAL error %d", (int32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        STM32WLxx_LOG_INFO("Successful GPIO handshake with STM32WLxx, proceeding with SPI handshake...");

        /* If we got here the IRQ pin is actively driven low by an external source - we can send a handshake message via SPI now */
        hal_err = stm32wlxx_hal_retrieve_radio_irq(&drv_ctx,  &irq_status, NULL, 0u);

        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_LOG_ERROR("Unable to retrieve STM32WLxx IRQ status. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
        }
        else
        {
            err = RADIO_ERROR_NONE;
            STM32WLxx_LOG_DEBUG("Retrieved STM32WLxx IRQ status. IRQ flags: 0x%x, followup data size: %u", irq_status.irq_flags, irq_status.followup_payload_len);
        }

        /* Send out IRQ acknowledgment to clear the IRQ indication by the STM32WLxx side - this is a mandatory step regardless of the valid or invalid IRQ indication */
        hal_err = stm32wlxx_hal_acknowledge_radio_irq(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_LOG_ERROR("Unable to acknowledge STM32WLxx IRQ status. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        hal_err = stm32wlxx_hal_wait_radio_irq_released(&drv_ctx, STM32WLxx_HAL_RADIO_IRQ_RELEASE_WAIT_TIME_US);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_LOG_ERROR("STM32WLxx failed to release the IRQ line after successful ACK. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Check that we have received a valid Handshake IRQ */
        if ((irq_status.irq_flags != STM32WLxx_APP_IRQ_SPI_HANDSHAKE) || (irq_status.followup_payload_len != 0u))
        {
            STM32WLxx_LOG_ERROR("STM32WLxx SPI Handshaking failed. STM32WLxx IRQ does not indicate the desired Handshake status. IRQ flags: 0x%x", irq_status.irq_flags);
            err = RADIO_ERROR_INVALID_STATE;
            break;
        }
        STM32WLxx_LOG_INFO("Successful SPI handshake with STM32WLxx");

        /* Do the protocol compatibility checks */
        const stm32wlxx_version_info_t * const remote_protocol_version = &irq_status.handshake_details.protocol_version;
        const stm32wlxx_version_info_t         local_protocol_version  = {
            .major = STM32WLxx_RADIO_COMM_PROTOCOL_MAJOR_VERSION,
            .minor = STM32WLxx_RADIO_COMM_PROTOCOL_MINOR_VERSION,
            .patch = STM32WLxx_RADIO_COMM_PROTOCOL_PATCH_VERSION,
        };

        /* Call user-defined protocol version check if available in the configuration */
        if (drv_ctx.config->protocol_compatibility_check_cb != NULL)
        {
            err = drv_ctx.config->protocol_compatibility_check_cb(&local_protocol_version, remote_protocol_version);
        }
        else
        {
            /* Do a default check if user configuration does not define its own */
            if ( (remote_protocol_version->major != local_protocol_version.major)
              || (remote_protocol_version->minor != local_protocol_version.minor)
              || (remote_protocol_version->patch != local_protocol_version.patch))
            {
                /* Display a warning but do not block the communication. Version mismatch is possible during OTA update, so inter-MCU communication channel shall be accessible to finalize an OTA */
                SID_PAL_LOG_WARNING("STM32WLxx runs SPI protocol v%u.%u.%u while host has v%u.%u.%u, compatibility issues possible",
                                    remote_protocol_version->major, remote_protocol_version->minor, remote_protocol_version->patch,
                                    local_protocol_version.major, local_protocol_version.minor, local_protocol_version.patch);
                err = RADIO_ERROR_NONE;
            }
            else
            {
                /* Protocol version fully match */
                err = RADIO_ERROR_NONE;
            }
        }
        if (err != RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("STM32WLxx implements incompatible SPI protocol v%u.%u.%u (host requires v%u.%u.%u)",
                              remote_protocol_version->major, remote_protocol_version->minor, remote_protocol_version->patch,
                              local_protocol_version.major, local_protocol_version.minor, local_protocol_version.patch);
            break;
        }
        SID_PAL_LOG_INFO("Reported STM32WLxx SPI protocol version: %u.%u.%u", remote_protocol_version->major, remote_protocol_version->minor, remote_protocol_version->patch);

        /* Call user-defined application version compatibility check if defined */
        const stm32wlxx_version_info_t * const remote_app_version = &irq_status.handshake_details.app_version;
        const stm32wlxx_version_info_t         local_app_version  = {
#if defined(SID_APP_VERSION_HEADER)
            .major = SID_APP_PROJECT_MAJOR_VERSION,
            .minor = SID_APP_PROJECT_MINOR_VERSION,
            .patch = SID_APP_PROJECT_PATCH_VERSION,
#else
            0u
#endif /* SID_APP_VERSION_HEADER */
        };

        if (drv_ctx.config->app_compatibility_check_cb != NULL)
        {
            err = drv_ctx.config->app_compatibility_check_cb(&local_app_version, remote_app_version);
        }
        else
        {
            /* By default app version check is not performed */
            err = RADIO_ERROR_NONE;
        }
        if (err != RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("STM32WLxx implements incompatible application v%u.%u.%u (host is v%u.%u.%u)",
                              remote_app_version->major, remote_app_version->minor, remote_app_version->patch,
                              local_app_version.major, local_app_version.minor, local_app_version.patch);
            break;
        }
        SID_PAL_LOG_INFO("Detected STM32WLxx with application version %u.%u.%u", remote_app_version->major, remote_app_version->minor, remote_app_version->patch);

        /* Handshake succeeded */
        STM32WLxx_LOG_DEBUG("Handshake procedure succeeded");
        err = RADIO_ERROR_NONE;
    } while (0);

