TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void radio_stm32wlxx_pack_settings(const sid_pal_radio_fsk_phy_settings_t * const fsk_phy_cfg,
                                                                           const sid_pal_radio_lora_phy_settings_t * const lora_phy_cfg,
                                                                           stm32wlxx_radio_phy_cfg_t * const out_cfg)
{
    /*---------------------------------- FSK -------------------------------------*/
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.freq ,                             fsk_phy_cfg->freq);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.power,                             fsk_phy_cfg->power);
    STM32WLxx_COPY_CFG_ARRAY_PARAM(out_cfg->fsk_cfg.sync_word,                   fsk_phy_cfg->sync_word);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.sync_word_len,                     fsk_phy_cfg->sync_word_len);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.whitening_seed,                    fsk_phy_cfg->whitening_seed);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.tx_timeout,                        fsk_phy_cfg->tx_timeout);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.symbol_timeout,                    fsk_phy_cfg->symbol_timeout);

    /* fsk_modulation_params */
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.mod.bit_rate,                      fsk_phy_cfg->fsk_modulation_params.bit_rate);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.mod.freq_dev,                      fsk_phy_cfg->fsk_modulation_params.freq_dev);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.mod.shaping,                       fsk_phy_cfg->fsk_modulation_params.mod_shaping);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.mod.bandwidth,                     fsk_phy_cfg->fsk_modulation_params.bandwidth);

    /* fsk_packet_params */
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.preamble_length,               fsk_phy_cfg->fsk_packet_params.preamble_length);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.preamble_min_detect,           fsk_phy_cfg->fsk_packet_params.preamble_min_detect);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.sync_word_length,              fsk_phy_cfg->fsk_packet_params.sync_word_length);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.addr_comp,                     fsk_phy_cfg->fsk_packet_params.addr_comp);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.header_type,                   fsk_phy_cfg->fsk_packet_params.header_type);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.crc_type,                      fsk_phy_cfg->fsk_packet_params.crc_type);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.pkt.radio_whitening_mode,          fsk_phy_cfg->fsk_packet_params.radio_whitening_mode);

    /* fsk_cad_params */
    /**
     * @attention This CAD section is somewhat obsolete starting from inter-MCU protocol version 1.1.0, but shall be preserved for backward
     *            compatibility. Now CAD/CS parameters are passed with every Start Carrier Sense command
     */
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.fsk_ed_rssi_threshold,             fsk_phy_cfg->fsk_cad_params.fsk_ed_rssi_threshold);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.fsk_ed_duration_mus,               fsk_phy_cfg->fsk_cad_params.fsk_ed_duration_mus);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.fsk_cs_min_prm_det,                fsk_phy_cfg->fsk_cad_params.fsk_cs_min_prm_det);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.fsk_cs_duration_us,                fsk_phy_cfg->fsk_cad_params.fsk_cs_duration_us);

    /* fsk_phy_hdr */
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.phy_hdr_fcs_type,                  (stm32wlxx_radio_fsk_fcs_t)fsk_phy_cfg->fsk_phy_hdr.fcs_type);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.phy_hdr_is_data_whitening_enabled, fsk_phy_cfg->fsk_phy_hdr.is_data_whitening_enabled);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->fsk_cfg.phy_hdr_is_fec_enabled,            fsk_phy_cfg->fsk_phy_hdr.is_fec_enabled);
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
    /*----------------------------------------------------------------------------*/

    /*---------------------------------- LoRa ------------------------------------*/
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.freq,                             lora_phy_cfg->freq);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.power,                            lora_phy_cfg->power);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.sync_word,                        lora_phy_cfg->sync_word);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.symbol_timeout,                   lora_phy_cfg->symbol_timeout);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.tx_timeout,                       lora_phy_cfg->tx_timeout);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.lora_ldr_long_interleaved_enable, lora_phy_cfg->lora_ldr_long_interleaved_enable);

    /* sid_pal_radio_lora_modulation_params */
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.mod.spreading_factor,             lora_phy_cfg->lora_modulation_params.spreading_factor);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.mod.bandwidth,                    lora_phy_cfg->lora_modulation_params.bandwidth);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.mod.coding_rate,                  lora_phy_cfg->lora_modulation_params.coding_rate);

    /* sid_pal_radio_lora_packet_params */
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.pkt.preamble_length,              lora_phy_cfg->lora_packet_params.preamble_length);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.pkt.header_type,                  lora_phy_cfg->lora_packet_params.header_type);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.pkt.payload_length,               lora_phy_cfg->lora_packet_params.payload_length);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.pkt.crc_mode,                     lora_phy_cfg->lora_packet_params.crc_mode);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.pkt.invert_IQ,                    lora_phy_cfg->lora_packet_params.invert_IQ);

    /* radio_lora_cad_params */
    /**
     * @attention This CAD section is somewhat obsolete starting from inter-MCU protocol version 1.1.0, but shall be preserved for backward
     *            compatibility. Now CAD parameters are passed with the Set LoRa CAD command
     */
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.cad_symbol_num,                   lora_phy_cfg->lora_cad_params.cad_symbol_num);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.cad_detect_peak,                  lora_phy_cfg->lora_cad_params.cad_detect_peak);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.cad_detect_min,                   lora_phy_cfg->lora_cad_params.cad_detect_min);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.cad_exit_mode,                    lora_phy_cfg->lora_cad_params.cad_exit_mode);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->lora_cfg.cad_timeout,                      lora_phy_cfg->lora_cad_params.cad_timeout);
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
    /*----------------------------------------------------------------------------*/

