TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
    /* Common driver setup -------------------------------------------------------*/
    STM32WLxx_COPY_CFG_PARAM(out_cfg->drv_cfg.irq_mask,                          drv_ctx.subghz_irq_mask);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->drv_cfg.rx_boost,                          drv_ctx.config->rx_boost);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->drv_cfg.cad_exit_mode,                     (stm32wlxx_pal_radio_cad_param_exit_mode_t)drv_ctx.cad_exit_mode);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->drv_cfg.lna_gain,                          drv_ctx.config->lna_gain);
    /*----------------------------------------------------------------------------*/

    /* Power amplifier config ----------------------------------------------------*/
    STM32WLxx_COPY_CFG_PARAM(out_cfg->pa_cfg.pa_duty_cycle,                      drv_ctx.pa_cfg.pa_duty_cycle);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->pa_cfg.hp_max,                             drv_ctx.pa_cfg.hp_max);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->pa_cfg.device_sel,                         drv_ctx.pa_cfg.device_sel);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->pa_cfg.pa_lut,                             drv_ctx.pa_cfg.pa_lut);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->pa_cfg.tx_power_reg,                       drv_ctx.pa_cfg.tx_power_reg);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->pa_cfg.ramp_time,                          drv_ctx.pa_cfg.ramp_time);
    STM32WLxx_COPY_CFG_PARAM(out_cfg->pa_cfg.target_tx_power,                    drv_ctx.pa_cfg.target_tx_power);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline int32_t radio_stm32wlxx_set_tx_power_config(const int8_t power)
{
    SID_PAL_ASSERT(drv_ctx.regional_radio_param != NULL);

    if (drv_ctx.radio_state != SID_PAL_RADIO_STANDBY)
    {
        return RADIO_ERROR_INVALID_STATE;
    }

#if HALO_ENABLE_DIAGNOSTICS
    if (false == drv_ctx.pa_cfg_configured)
#endif
    {
        /* Compute the target Tx power taking into account the antenna gain */
        int32_t target_pwr = power;
        switch (drv_ctx.regional_radio_param->param_region)
        {
            case RADIO_REGION_NA:
            if (drv_ctx.regional_radio_param->ant_dbi > STM32WLxx_ANT_GAIN_CAP_REGION_NA)
            {
                /* As per the FCC requirements PA gain shall be reduced by the difference between antenna gain and the antenna gain cap value */
                target_pwr -= ((int32_t)drv_ctx.regional_radio_param->ant_dbi - STM32WLxx_ANT_GAIN_CAP_REGION_NA);
                target_pwr = (target_pwr >= 0) ? ((target_pwr + 50) / 100) : ((target_pwr - 50) / 100);
            }
            break;

        case RADIO_REGION_EU:
            /* EU requirements put the limit on EIRP - PA gain shall be reduced by antenna gain */
            target_pwr -= (int32_t)drv_ctx.regional_radio_param->ant_dbi;
            target_pwr = (target_pwr >= 0) ? ((target_pwr + 50) / 100) :((target_pwr - 50) / 100);
            break;

        case RADIO_REGION_NONE:
        default:
            /* Apply PA gain as is */
            break;
        }

        /* Fill-in drv_ctx.pa_cfg with invalid values */
        SID_STM32_UTIL_fast_memset(&drv_ctx.pa_cfg, STM32WLxx_PA_CFG_PARAM_INVALID, sizeof(drv_ctx.pa_cfg));

        /* Call app callback to populate PA config - this allows the app to override the default values */
        if (drv_ctx.config->pa_cfg_callback(target_pwr, drv_ctx.regional_radio_param, &drv_ctx.pa_cfg) != RADIO_ERROR_NONE)
        {
            return RADIO_ERROR_INVALID_PARAMS;
        }

        /* Check if the callback applied custom PA config */
        if ((STM32WLxx_PA_CFG_PARAM_INVALID == drv_ctx.pa_cfg.pa_duty_cycle)
         || (STM32WLxx_PA_CFG_PARAM_INVALID == drv_ctx.pa_cfg.hp_max)
         || (STM32WLxx_PA_CFG_PARAM_INVALID == drv_ctx.pa_cfg.device_sel)
         || (STM32WLxx_PA_CFG_PARAM_INVALID == drv_ctx.pa_cfg.pa_lut)
         || (STM32WLxx_PA_CFG_PARAM_INVALID == (uint8_t)drv_ctx.pa_cfg.tx_power_reg)
         || (STM32WLxx_PA_CFG_PARAM_INVALID == (uint8_t)drv_ctx.pa_cfg.target_tx_power))
        {
            /* At least one PA config param was not set - apply default config */

            /* Check if the callback changed the target Tx power */
            if (STM32WLxx_PA_CFG_PARAM_INVALID == (uint8_t)drv_ctx.pa_cfg.target_tx_power)
            {
                drv_ctx.pa_cfg.target_tx_power = (int8_t)target_pwr;
            }

            /* Apply the optimized PA settings as per the application note to achieve the lower power consumption */
            if ((drv_ctx.config->enable_lpa != false)  && (drv_ctx.config->enable_hpa != false))
            {
                /* Both HPA and LPA are enabled - select the PA to use based on the targeted Tx power */
                if (drv_ctx.pa_cfg.target_tx_power > RADIO_STM32WLxx_LPA_UPPER_LIMIT_DBM)
                {
                    /* Requested Tx power exceeds the capabilities of LPA - use HPA for it */
                    drv_ctx.pa_cfg.device_sel = STM32WLxx_PA_CFG_USE_HPA;
                }
                else
                {
                    /* Requested Tx power can be achieved with LPA */
                    drv_ctx.pa_cfg.device_sel = STM32WLxx_PA_CFG_USE_LPA;
                }
            }
            else if (drv_ctx.config->enable_hpa != false)
            {
                /* Only HPA is enabled */
                drv_ctx.pa_cfg.device_sel = STM32WLxx_PA_CFG_USE_HPA;
            }
            else
            {
                /* Only LPA is enabled */
                drv_ctx.pa_cfg.device_sel = STM32WLxx_PA_CFG_USE_LPA;
            }

            /* Configure PA parameters based on the selected PA */
            if (STM32WLxx_PA_CFG_USE_HPA == drv_ctx.pa_cfg.device_sel)
            {
                /* Saturate by upper limit for HPA */
                if (drv_ctx.pa_cfg.target_tx_power > RADIO_STM32WLxx_HPA_UPPER_LIMIT_DBM)
                {
                    drv_ctx.pa_cfg.target_tx_power = RADIO_STM32WLxx_HPA_UPPER_LIMIT_DBM;
                }

                /* Search for the closest optimized config - configure as per AN5457 */
                if (drv_ctx.pa_cfg.target_tx_power <= STM32WLxx_PA_CFG_HPA_OPTIMIZATION_14_DBM)
                {
                    /* +14dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x02u;
                    drv_ctx.pa_cfg.hp_max        = 0x02u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = drv_ctx.pa_cfg.target_tx_power;
                }
                else if (drv_ctx.pa_cfg.target_tx_power <= STM32WLxx_PA_CFG_HPA_OPTIMIZATION_17_DBM)
                {
                    /* +17dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x02u;
                    drv_ctx.pa_cfg.hp_max        = 0x03u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = RADIO_STM32WLxx_HPA_UPPER_LIMIT_DBM - (STM32WLxx_PA_CFG_HPA_OPTIMIZATION_17_DBM - drv_ctx.pa_cfg.target_tx_power);
                }
                else if (drv_ctx.pa_cfg.target_tx_power <= STM32WLxx_PA_CFG_HPA_OPTIMIZATION_20_DBM)
                {
                    /* +20dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x03u;
                    drv_ctx.pa_cfg.hp_max        = 0x05u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = RADIO_STM32WLxx_HPA_UPPER_LIMIT_DBM - (STM32WLxx_PA_CFG_HPA_OPTIMIZATION_20_DBM - drv_ctx.pa_cfg.target_tx_power);
                }
                else
                {
                    /* +22dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x04u;
                    drv_ctx.pa_cfg.hp_max        = 0x07u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = drv_ctx.pa_cfg.target_tx_power;
                }

                /* Saturate by lower limit for HPA */
                if (drv_ctx.pa_cfg.tx_power_reg < RADIO_STM32WLxx_HPA_LOWER_LIMIT_DBM)
                {
                    drv_ctx.pa_cfg.tx_power_reg = RADIO_STM32WLxx_HPA_LOWER_LIMIT_DBM;
                }
            }
            else
            {
                /* Saturate by upper limit for LPA */
                if (drv_ctx.pa_cfg.target_tx_power > RADIO_STM32WLxx_LPA_UPPER_LIMIT_DBM)
                {
                    drv_ctx.pa_cfg.target_tx_power = RADIO_STM32WLxx_LPA_UPPER_LIMIT_DBM;
                }

                /* Search for the closest optimized config - configure as per AN5457 */
                if (drv_ctx.pa_cfg.target_tx_power <= STM32WLxx_PA_CFG_LPA_OPTIMIZATION_10_DBM)
                {
                    /* +10dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x01u;
                    drv_ctx.pa_cfg.hp_max        = 0x00u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = 13 - (STM32WLxx_PA_CFG_LPA_OPTIMIZATION_10_DBM - drv_ctx.pa_cfg.target_tx_power);
                }
                else if (drv_ctx.pa_cfg.target_tx_power <= STM32WLxx_PA_CFG_LPA_OPTIMIZATION_14_DBM)
                {
                    /* +14dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x04u;
                    drv_ctx.pa_cfg.hp_max        = 0x00u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = drv_ctx.pa_cfg.target_tx_power;
                }
                else
                {
                    /* +15dBm optimization */
                    drv_ctx.pa_cfg.pa_duty_cycle = 0x07u;
                    drv_ctx.pa_cfg.hp_max        = 0x00u;
                    drv_ctx.pa_cfg.pa_lut        = 0x01u;
                    drv_ctx.pa_cfg.tx_power_reg  = STM32WLxx_PA_CFG_LPA_OPTIMIZATION_14_DBM - (RADIO_STM32WLxx_LPA_UPPER_LIMIT_DBM - drv_ctx.pa_cfg.target_tx_power);
                }

                /* Saturate by lower limit for HPA */
                if (drv_ctx.pa_cfg.tx_power_reg < RADIO_STM32WLxx_LPA_LOWER_LIMIT_DBM)
                {
                    drv_ctx.pa_cfg.tx_power_reg = RADIO_STM32WLxx_LPA_LOWER_LIMIT_DBM;
                }
            }
        }

        /* Check if the callback specified the ramp up time */
        if (STM32WLxx_PA_CFG_PARAM_INVALID == drv_ctx.pa_cfg.ramp_time)
        {
            /* Use the default value */
            drv_ctx.pa_cfg.ramp_time = RADIO_STM32WLxx_RAMP_40_US;
        }
    }

