TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
    return RADIO_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void radio_stm32wlxx_error_manager(const int32_t reported_err, const uint32_t set_radio_sleep)
{
    if (reported_err != RADIO_ERROR_NONE)
    {
        /* A new error was reported - increment error counter and update the timestamp */
        drv_ctx.error_monitor.drv_err_cntr += STM32WLxx_RADIO_ERROR_ASYM_INC_FACTOR; /* Make the error counter increment faster than decrement to address interleaved errors (e.g. error - no error - error - no error, etc.) */
        (void)sid_pal_uptime_now(&drv_ctx.error_monitor.last_err_timestamp);
    }
    else
    {
        /* Operation completed successfully - decrement the error counter */
        if (drv_ctx.error_monitor.drv_err_cntr > 0u)
        {
            drv_ctx.error_monitor.drv_err_cntr--;
        }
    }

    /* Check if we are above the error threshold and react if needed */
    if (drv_ctx.error_monitor.drv_err_cntr > (STM32WLxx_RADIO_ERROR_LIMIT * STM32WLxx_RADIO_ERROR_ASYM_INC_FACTOR))
    {
        int32_t                err;
        stm32wlxx_hal_status_t hal_err;

        SID_PAL_LOG_WARNING("Too many radio errors in a row. Resetting the radio...");

        drv_ctx.radio_state = SID_PAL_RADIO_UNKNOWN;

        do
        {
            /* Ensure STM32WLxx won't trigger any interrupt if we are re-initializing ----*/
            hal_err = stm32wlxx_hal_disarm_irq(&drv_ctx);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                /* Logs are provided by the stm32wlxx_hal_disarm_irq() */
                err = RADIO_ERROR_HARDWARE_ERROR;
                break;
            }
            __COMPILER_BARRIER(); /* Ensure IRQ is disarmed right now before any further actions take place */
            /*----------------------------------------------------------------------------*/

            /* Bring down the underlying hardware */
            err = radio_stm32wlxx_platform_deinit();
            if (err != RADIO_ERROR_NONE)
            {
                STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_deinit() failed. Error %d", err);
                break;
            }

            /* Initialize the underlying hardware */
            err = radio_stm32wlxx_platform_init();
            if (err != RADIO_ERROR_NONE)
            {
                STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_init() failed with error %d", err);
                err = RADIO_ERROR_HARDWARE_ERROR;
                break;
            }

            /* Invalidate radio state since the WL side may be in LPM mode */
            drv_ctx.radio_state = SID_PAL_RADIO_UNKNOWN;

            /* Perform multiple attempts of handshaking with the STM32WLxx ---------------*/
            uint32_t handshake_attempts_counter = 0u;
            do
            {
                handshake_attempts_counter++;

                err = radio_stm32wlxx_do_handshake();
                if ((RADIO_ERROR_NONE == err) || (RADIO_ERROR_NOT_SUPPORTED == err))
                {
                    /* Exit either on success or unrecoverable error */
                    break;
                }
            } while (handshake_attempts_counter < STM32WLxx_HANDSHAKE_ATTEMPTS_LIMIT);

            /* Check if Handshake procedure succeeded */
            if (err != RADIO_ERROR_NONE)
            {
                STM32WLxx_LOG_ERROR("radio_stm32wlxx_do_handshake() failed with error %d", err);
                break;
            }
            /*----------------------------------------------------------------------------*/

            /* Now configure STM32WLxx IRQ line in as a regular IRQ line -----------------*/
            hal_err = stm32wlxx_hal_arm_irq(&drv_ctx);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                /* Logs are provided by the stm32wlxx_hal_arm_irq() */
                err = RADIO_ERROR_HARDWARE_ERROR;
                break;
            }
            /*----------------------------------------------------------------------------*/

            /* Ensure STM32WLxx's SubGHz radio is in Standby -----------------------------*/
            hal_err = stm32wlxx_hal_radio_standby(&drv_ctx); /* Don't use sid_pal_radio_standby() to avoid recursive calls */
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                STM32WLxx_LOG_ERROR("Failed to put SubGHz to StandBy. HAL error %u", (uint32_t)hal_err);
                err = RADIO_ERROR_HARDWARE_ERROR;
                break;
            }

            drv_ctx.radio_state = SID_PAL_RADIO_STANDBY;
            /*----------------------------------------------------------------------------*/

            /* Send out SubGHz radio configuration via SPI to STM32WLxx ------------------*/
            err = stm32wlxx_radio_send_subghz_config(FALSE, FALSE);
            if (err != RADIO_ERROR_NONE)
            {
                /* Logs are provided by stm32wlxx_radio_send_subghz_config() */
                SID_PAL_LOG_ERROR("Failed to re-send SubGHz HW config. Error %d", err);
                break;
            }

            /* Perform the final STM32WLxx Sidewalk Radio App initialization steps */
            hal_err = stm32wlxx_hal_apply_base_hw_config(&drv_ctx, FALSE);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                SID_PAL_LOG_ERROR("Failed to apply essential SubGHz HW config. Error code %u", (uint32_t)hal_err);
                err = RADIO_ERROR_IO_ERROR;
                break;
            }

            /* Explicitly set modem mode on the remote side */
            hal_err = stm32wlxx_hal_radio_set_modem_mode(&drv_ctx, drv_ctx.modem);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                SID_PAL_LOG_ERROR("Failed to set SubGHz modem mode. Error code %u", (uint32_t)hal_err);
                err = RADIO_ERROR_IO_ERROR;
                break;
            }

            /* Restore the selected radio frequency */
            hal_err = stm32wlxx_hal_radio_set_frequency(&drv_ctx, drv_ctx.radio_freq_hz);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                SID_PAL_LOG_ERROR("Failed to set SubGHz frequency. Error code %u", (uint32_t)hal_err);
                err = RADIO_ERROR_IO_ERROR;
                break;
            }

