TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
            /* Put the radio into Sleep mode if requested */
            if (set_radio_sleep != FALSE)
            {
                hal_err = stm32wlxx_hal_radio_sleep(&drv_ctx, 0u, FALSE); /* Don't use sid_pal_radio_sleep() to avoid recursive calls */
                if (hal_err != STM32WLxx_HAL_STATUS_OK)
                {
                    /* This is not a fatal error. The radio is in Standby already, software may proceed even if the radio failed to enter Sleep back for some reason. There's only power consumption penalty here */
                    SID_PAL_LOG_ERROR("Failed to put STM32WLxx back to sleep. Error code %u", (uint32_t)hal_err);
                    err = RADIO_ERROR_IO_ERROR;
                    drv_ctx.radio_state = SID_PAL_RADIO_UNKNOWN;
                    break;
                }

                /* The radio is back in Sleep now */
                drv_ctx.radio_state = SID_PAL_RADIO_SLEEP;
            }
            else
            {
                /* The radio is in Standby now as a result of the handshake procedure */
            }

            /* Radio re-initialized successfully */
            err = RADIO_ERROR_NONE;
            drv_ctx.error_monitor.drv_err_cntr = 0u;
            SID_PAL_LOG_INFO("Radio re-initialized");
        } while (0);

        if (err != RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to re-initialize STM32WLxx radio. This may indicate a permanent failure");
        }
    }
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline int32_t radio_stm32wlxx_get_adjusted_rssi(const int32_t raw_rssi)
{
    const int32_t rssi_adjustment = (drv_ctx.regional_radio_param->ant_dbi >= 0) ? ((drv_ctx.regional_radio_param->ant_dbi + 50) / 100) : ((drv_ctx.regional_radio_param->ant_dbi - 50) / 100);
    const int32_t adjusted_rssi = raw_rssi - rssi_adjustment;
    return adjusted_rssi;
}

/*----------------------------------------------------------------------------*/

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
SID_STM32_SPEED_OPTIMIZED static inline uint32_t _user_data_transfer_check_transfers_allowed(void)
{
    sid_error_t         sid_err;
    struct sid_timespec t_now;

    /* Calculate the available time for UDT transfers */
    sid_err = sid_pal_uptime_now(&t_now);
    SID_PAL_ASSERT(SID_ERROR_NONE == sid_err);

    if ((sid_time_is_infinity(&drv_ctx.udt_ctx.cut_off_time) == FALSE)
      && (sid_time_gt(&t_now, &drv_ctx.udt_ctx.cut_off_time) != FALSE))
    {
        /* No time left for UDT */
        drv_ctx.udt_ctx.udt_enabled = FALSE;
    }

    return drv_ctx.udt_ctx.udt_enabled;
}
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

/*----------------------------------------------------------------------------*/

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
SID_STM32_SPEED_OPTIMIZED static void _user_data_transfer_thread(void * context)
{
    osStatus_t os_err;
    uint32_t   flags;

    (void)context;

    SID_PAL_ASSERT(drv_ctx.udt_ctx.outbound_msg_queue != NULL);

    do
    {
        /* Ensure the radio is fully initialized before any further actions */
        while (FALSE == drv_ctx.init_done)
        {
            /* Wait for driver initialization */
            flags = osThreadFlagsWait(STM32WLxx_UDT_TASK_FLAG_INIT_DONE, osFlagsWaitAll, osWaitForever);
            SID_PAL_ASSERT((flags & osFlagsError) == 0u); /* Check against systematic failures */
        }

        /* Wait for any user app requests to send out data to the STM32WLxx side */
        stm32wlxx_ext_ifc_out_msg_desc_t msg_desc;
        os_err = osMessageQueueGet(drv_ctx.udt_ctx.outbound_msg_queue, &msg_desc, NULL, osWaitForever);

        if (osOK == os_err)
        {
            if ((msg_desc.data_ptr != NULL) && (msg_desc.data_len > 0u))
            {
                stm32wlxx_hal_status_t hal_err;

                /* Wait until UDT is allowed */
                while (_user_data_transfer_check_transfers_allowed() == FALSE)
                {
                    flags = osThreadFlagsWait(STM32WLxx_UDT_TASK_FLAG_UDT_ENABLED, osFlagsWaitAll, osWaitForever);
                    SID_PAL_ASSERT((flags & osFlagsError) == 0u); /* Check against systematic failures */
                }

                /* Send out user data. Use critical section to guarantee atomic data transfer (e.g. avoid interruption mid-flight by sid_pal_radio_standby() ) */
                sid_pal_enter_critical_region();
                hal_err = stm32wlxx_hal_send_user_data(&drv_ctx, msg_desc.data_ptr, msg_desc.data_len);
                sid_pal_exit_critical_region();
                if (hal_err != STM32WLxx_HAL_STATUS_OK)
                {
                    SID_PAL_LOG_ERROR("UDT failed to send out %u bytes. HAL error %u", msg_desc.data_len, (uint32_t)hal_err);
                }
                else
                {
                    SID_PAL_LOG_DEBUG("UDT sent %u bytes", msg_desc.data_len);
                }

                /* Automatically free the buffer after processing is done (if requested) */
                if (msg_desc.auto_free != FALSE)
                {
                    free(msg_desc.data_ptr);
                }
            }
            else
            {
                SID_PAL_LOG_WARNING("UDT transfer skipped - empty data provided");
            }
        }
        else
        {
            /* Some unexpected CMSIS/OS error occurred */
            SID_PAL_LOG_ERROR("Unexpected error while accessing UDT queue. OS error 0x%08x", (uint32_t)os_err);
        }
    } while (TRUE);

    /* Terminate the thread properly if the code ever gets here */
    SID_PAL_LOG_WARNING("UDT thread terminated");
    osThreadExit();
}
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t stm32wlxx_radio_send_subghz_config(const uint32_t use_defaults, const uint32_t need_ack)
{
    uint32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    do
    {
        /* Collect the settings */
        const sid_pal_radio_fsk_phy_settings_t * const fsk_phy_settings =
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
                                                                            (FALSE == use_defaults) ? &drv_ctx.applied_fsk_phy_cfg : radio_stm32wlxx_fsk_get_default_phy_config();
#else
                                                                            NULL;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */

        const sid_pal_radio_lora_phy_settings_t * const lora_phy_settings =
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
                                                                            (FALSE == use_defaults) ? &drv_ctx.applied_lora_phy_cfg : radio_stm32wlxx_lora_get_default_phy_config();
#else
                                                                            NULL;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */

        stm32wlxx_radio_phy_cfg_t subghz_cfg = {0};

        radio_stm32wlxx_pack_settings(fsk_phy_settings, lora_phy_settings, &subghz_cfg);

        /* Send out the settings and wait for them to be applied */
        hal_err = stm32wlxx_hal_send_subghz_config(&drv_ctx, &subghz_cfg, need_ack);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Unable to send out config to STM32WLxx. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_IO_ERROR;
            break;
        }

        /* Save the applied Phy settings as sent to the STM32WLxx */
        if (use_defaults != FALSE)
        {
            sid_pal_enter_critical_region();

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
            SID_STM32_UTIL_fast_memcpy(&drv_ctx.applied_fsk_phy_cfg,  fsk_phy_settings,  sizeof(drv_ctx.applied_fsk_phy_cfg));
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
            SID_STM32_UTIL_fast_memcpy(&drv_ctx.applied_lora_phy_cfg, lora_phy_settings, sizeof(drv_ctx.applied_lora_phy_cfg));
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */

            sid_pal_exit_critical_region();
        }

        err = RADIO_ERROR_NONE;
    } while (0);

