TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED const halo_drv_stm32wlxx_ctx_t* stm32wlxx_radio_get_drv_ctx_ctx(void)
{
    return &drv_ctx;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED void stm32wlxx_app_radio_set_device_config(const stm32wlxx_app_radio_device_config_t * const cfg)
{
    /* Validate the config */
    if ((false == cfg->enable_lpa) && (false == cfg->enable_hpa))
    {
        SID_PAL_LOG_ERROR("Invalid radio config - both LPA and HPA are disabled. At least one PA shall be enabled");
        SID_PAL_ASSERT(0);
    }

    /* Store the config */
    drv_ctx.config = cfg;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint8_t sid_pal_radio_get_status(void)
{
    return drv_ctx.radio_state;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_pal_radio_modem_mode_t sid_pal_radio_get_modem_mode(void)
{
    sid_pal_radio_modem_mode_t mode;

    switch (drv_ctx.modem)
    {
        case STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK:
            mode = SID_PAL_RADIO_MODEM_MODE_FSK;
            break;

        case STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA:
            mode = SID_PAL_RADIO_MODEM_MODE_LORA;
            break;

        case STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_UNDEFINED:
        default:
            SID_PAL_LOG_ERROR("sid_pal_radio_get_modem_mode() called with modem in undefined state");
            mode = SID_PAL_RADIO_MODEM_MODE_LORA; /* Default to LoRa for compatibility with previous implementations */
            break;
    }

    return mode;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_modem_mode(sid_pal_radio_modem_mode_t mode)
{
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("sid_pal_radio_set_modem_mode...");

    /* Skip the switch if we are already in the requested modem mode */
    if ((sid_pal_radio_get_modem_mode() == mode) && (drv_ctx.modem != STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_UNDEFINED))
    {
        STM32WLxx_LOG_DEBUG("Set Modem Mode skipped - already in requested mode");
        err = RADIO_ERROR_NONE;
        return err;
    }

    /* Send out modem mode switch request */
    switch (mode)
    {
        case SID_PAL_RADIO_MODEM_MODE_FSK:
            hal_err = stm32wlxx_hal_radio_set_modem_mode(&drv_ctx, STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK);
            if (STM32WLxx_HAL_STATUS_OK == hal_err)
            {
                drv_ctx.modem = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK;
                drv_ctx.subghz_irq_mask = STM32WLxx_RADIO_COMM_DEFAULT_FSK_IRQ_MASK;
                err = RADIO_ERROR_NONE;
            }
            else
            {
                STM32WLxx_LOG_ERROR("sid_pal_radio_set_modem_mode failed to set FSK mode. HAL error %u", (uint32_t)hal_err);
                err = RADIO_ERROR_IO_ERROR;
            }
            break;

        case SID_PAL_RADIO_MODEM_MODE_LORA:
            hal_err = stm32wlxx_hal_radio_set_modem_mode(&drv_ctx, STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA);
            if (STM32WLxx_HAL_STATUS_OK == hal_err)
            {
                drv_ctx.modem = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA;
                drv_ctx.subghz_irq_mask = STM32WLxx_RADIO_COMM_DEFAULT_LORA_IRQ_MASK;
                err = RADIO_ERROR_NONE;
            }
            else
            {
                STM32WLxx_LOG_ERROR("sid_pal_radio_set_modem_mode failed to set LoRa mode. HAL error %u", (uint32_t)hal_err);
                err = RADIO_ERROR_IO_ERROR;
            }
            break;

        default:
            STM32WLxx_LOG_ERROR("sid_pal_radio_set_modem_mode failed - invalid mode requested: %u", (uint32_t)mode);
            err = RADIO_ERROR_NOT_SUPPORTED;
            break;
    }

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set SubGHz modem mode. Error %d", err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_irq_process(void)
{
    int32_t err;
    stm32wlxx_hal_status_t hal_err;

    do
    {
        /* Call the generic IRQ handler. It may subsequently call the Sidewalk-specific handler if a Sidewalk-related radio IRQ was reported */
        hal_err = stm32wlxx_hal_generic_irq_process(&drv_ctx, &err);

        /* Give priority to the error reported by the Sidewalk-specific handler */
        if (err != RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Sidewalk sub-GHz radio event processing failed. error %d", err);
            break;
        }

        /* React on the generic IRQ handler errors */
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            /* Logs are provided by stm32wlxx_hal_generic_irq_process() */
            break;
        }

        /* Done */
        hal_err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    /* Unconditionally re-enable STM32WLxx radio IRQ line regardless of the IRQ processing outcomes */
    stm32wlxx_hal_status_t rearm_err = stm32wlxx_hal_arm_irq(&drv_ctx);
    if (rearm_err != STM32WLxx_HAL_STATUS_OK)
    {
        SID_PAL_LOG_ERROR("Failed to re-arm STM32WLxx IRQ line. error %u", (uint32_t)hal_err);
    }

    hal_err = hal_err != STM32WLxx_HAL_STATUS_OK ? hal_err : rearm_err;
    err = err != RADIO_ERROR_NONE ? err : RADIO_ERROR_IO_ERROR;

    return RADIO_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t stm32wlxx_radio_sidewalk_event_process(void)
{
    int32_t err;
    sid_pal_radio_events_t radio_event = SID_PAL_RADIO_EVENT_UNKNOWN;

    do
    {
        /* Last IRQ status shall be stored already in the driver context when we get here */
        const stm32wlxx_app_irq_mask_t active_irq = (stm32wlxx_app_irq_mask_t)drv_ctx.last_irq_status.irq_flags;

        /* Ensure that STM32WLxx_APP_IRQ_SUBGHZ is indicated and this is the only interrupt being present */
        if (active_irq != STM32WLxx_APP_IRQ_SUBGHZ)
        {
            STM32WLxx_LOG_ERROR("SubGHz IRQ processing called with unexpected IRQ flags set: 0x%x", (uint32_t)active_irq);
            err = RADIO_ERROR_INVALID_STATE;
            break;
        }

        /* Now handle the STM32WLxx_APP_IRQ_SUBGHZ IRQ */
        const stm32wlxx_subghz_irq_details_t * const irq_details = &drv_ctx.last_irq_status.subghz_irq_details;

        /* fill in fields of internal structures */
        radio_event           = (sid_pal_radio_events_t)irq_details->radio_event;
        drv_ctx.radio_state   = irq_details->radio_state;
        drv_ctx.cad_exit_mode = (sid_pal_radio_cad_param_exit_mode_t)irq_details->cad_exit_mode;

        /* IMPORTANT: any received radio Rx buffer is already stored to drv_ctx.radio_rx_packet->rcv_payload and
         *            drv_ctx.radio_rx_packet->payload_len is set to the valid length is set by
         *            radio_stm32wlxx_on_irq_detected(), so we don't have to deal with it here
         */

        if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == drv_ctx.modem)
        {
            /* copy FSK status */
            STM32WLxx_COPY_CFG_PARAM(drv_ctx.radio_rx_packet->fsk_rx_packet_status.rssi_avg,        irq_details->received_packet_info.fsk_rx_packet_status.rssi_avg);
            STM32WLxx_COPY_CFG_PARAM(drv_ctx.radio_rx_packet->fsk_rx_packet_status.rssi_sync,       irq_details->received_packet_info.fsk_rx_packet_status.rssi_sync);
            STM32WLxx_COPY_CFG_PARAM(drv_ctx.radio_rx_packet->fsk_rx_packet_status.snr,             irq_details->received_packet_info.fsk_rx_packet_status.snr);

            /* Compensate for antenna gain to get unified RSSI readings */
            drv_ctx.radio_rx_packet->fsk_rx_packet_status.rssi_avg  = (int8_t)radio_stm32wlxx_get_adjusted_rssi(drv_ctx.radio_rx_packet->fsk_rx_packet_status.rssi_avg);
            drv_ctx.radio_rx_packet->fsk_rx_packet_status.rssi_sync = (int8_t)radio_stm32wlxx_get_adjusted_rssi(drv_ctx.radio_rx_packet->fsk_rx_packet_status.rssi_sync);
        }
        else if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA == drv_ctx.modem)
        {
            /* copy LoRa status */
            STM32WLxx_COPY_CFG_PARAM(drv_ctx.radio_rx_packet->lora_rx_packet_status.rssi,           irq_details->received_packet_info.lora_rx_packet_status.rssi);
            STM32WLxx_COPY_CFG_PARAM(drv_ctx.radio_rx_packet->lora_rx_packet_status.signal_rssi,    irq_details->received_packet_info.lora_rx_packet_status.signal_rssi);
            STM32WLxx_COPY_CFG_PARAM(drv_ctx.radio_rx_packet->lora_rx_packet_status.snr,            irq_details->received_packet_info.lora_rx_packet_status.snr);
            STM32WLxx_COPY_CFG_PARAM(drv_ctx.radio_rx_packet->lora_rx_packet_status.is_crc_present, (sid_pal_radio_lora_crc_present_t)irq_details->received_packet_info.lora_rx_packet_status.is_crc_present);

            /* Compensate for antenna gain to get unified RSSI readings */
            drv_ctx.radio_rx_packet->lora_rx_packet_status.rssi        = (int8_t)radio_stm32wlxx_get_adjusted_rssi(drv_ctx.radio_rx_packet->lora_rx_packet_status.rssi);
            drv_ctx.radio_rx_packet->lora_rx_packet_status.signal_rssi = (int8_t)radio_stm32wlxx_get_adjusted_rssi(drv_ctx.radio_rx_packet->lora_rx_packet_status.signal_rssi);
        }
        else
        {
            SID_PAL_LOG_ERROR("STM32WLxx SubGHz IRQ reported with modem in unknown state. Cannot process");
            err = RADIO_ERROR_INVALID_STATE;
            break;
        }

        /* Radio is automatically transitioned into Standby state by the STM32WLxx side for the events below */
        if ((SID_PAL_RADIO_EVENT_RX_TIMEOUT == radio_event) || (SID_PAL_RADIO_EVENT_RX_DONE == radio_event) || (SID_PAL_RADIO_EVENT_TX_DONE == radio_event) || (SID_PAL_RADIO_EVENT_TX_TIMEOUT == radio_event)
          || (SID_PAL_RADIO_EVENT_RX_ERROR == radio_event) || (SID_PAL_RADIO_EVENT_HEADER_ERROR == radio_event) || (SID_PAL_RADIO_EVENT_CS_DONE == radio_event) || (SID_PAL_RADIO_EVENT_CAD_DONE == radio_event)
          || (SID_PAL_RADIO_EVENT_CAD_TIMEOUT == radio_event))
        {
            drv_ctx.radio_state = SID_PAL_RADIO_STANDBY;

#if (CFG_LPM_LEVEL != 0)
            /* Allow Stop mode after Rx/Tx is finished */
            UTIL_LPM_SetStopMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_ENABLE);
#  if (CFG_LPM_STDBY_SUPPORTED != 0)
            UTIL_LPM_SetOffMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_ENABLE);
#  endif /* CFG_LPM_STDBY_SUPPORTED */
#endif /* (CFG_LPM_LEVEL != 0) */
        }

        /* Notify the stack about SubGHz radio event */
        if (SID_PAL_RADIO_EVENT_UNKNOWN != radio_event)
        {
#if SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT
            /* Clear Rx/Tx starting point indication */
            SIDEWALK_RF_TIMINGS_RXTX_START_GPIO_Port->BRR = SIDEWALK_RF_TIMINGS_RXTX_START_Pin;
#endif /* SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT */

#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
            /* Turn off activity LEDs - any event means activities are finished */
            stm32wlxx_radio_hal_tx_led_off(&drv_ctx);
            stm32wlxx_radio_hal_rx_led_off(&drv_ctx);
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

