TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
            /* Notify the radio about the event - make sure this is the last action after all GPIO handling and LPM management since drv_ctx.report_radio_event() may modify GPIO and LPM states */
            drv_ctx.report_radio_event(radio_event);
        }

        err = RADIO_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_frequency(uint32_t freq)
{
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("sid_pal_radio_set_frequency - freq: %u", freq);

    do
    {
        if (drv_ctx.radio_state != SID_PAL_RADIO_STANDBY)
        {
            err = RADIO_ERROR_INVALID_STATE;
            break;
        }

        if (freq == drv_ctx.radio_freq_hz)
        {
            STM32WLxx_LOG_DEBUG("freq is already set to %u - skipping request", freq);
            err = RADIO_ERROR_NONE;
            break;
        }

        hal_err = stm32wlxx_hal_radio_set_frequency(&drv_ctx, freq);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Store the newly applied frequency to the context */
        drv_ctx.radio_freq_hz = freq;

        err = RADIO_ERROR_NONE;
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set STM32WLxx SubGHz modem frequency to %u. Error %d, state: %u", freq, err, drv_ctx.radio_state);
    }

    radio_stm32wlxx_error_manager(err, FALSE);
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_get_max_tx_power(sid_pal_radio_data_rate_t data_rate, int8_t *tx_power)
{
    int32_t err;

    SID_PAL_ASSERT(drv_ctx.regional_radio_param != NULL);

    if ((data_rate <= SID_PAL_RADIO_DATA_RATE_INVALID) || (data_rate > SID_PAL_RADIO_DATA_RATE_MAX_NUM))
    {
        err = RADIO_ERROR_INVALID_PARAMS;
    }
    else
    {
        *tx_power = drv_ctx.regional_radio_param->max_tx_power[data_rate - 1];
        err = RADIO_ERROR_NONE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_region(sid_pal_radio_region_code_t region)
{
    /* By default report the requested region is not supported */
    int32_t err = RADIO_ERROR_NOT_SUPPORTED;

    /* Validate inputs */
    if ((region <= SID_PAL_RADIO_RC_NONE) || (region >= SID_PAL_RADIO_RC_MAX))
    {
        SID_PAL_LOG_ERROR("%d is not a valid radio region ID", (int32_t)region);
        return RADIO_ERROR_INVALID_PARAMS;
    }

    /* Loop through the available regional params to find a matching config */
    for (uint32_t i = 0u; i < drv_ctx.config->regional_config.reg_param_table_size; i++)
    {
        if (drv_ctx.config->regional_config.reg_param_table[i].param_region == region)
        {
            /* Found the desired regional config */
            drv_ctx.regional_radio_param = &drv_ctx.config->regional_config.reg_param_table[i];
            err = RADIO_ERROR_NONE;
            break;
        }
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t stm32wlxx_radio_get_pa_config(stm32wlxx_radio_pa_cfg_t * const cfg)
{
    int32_t err;
    if (NULL == cfg)
    {
        err = RADIO_ERROR_INVALID_PARAMS;
    }
    else
    {
        *cfg = drv_ctx.pa_cfg;
        err = RADIO_ERROR_NONE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_tx_power(int8_t power)
{
    int32_t                err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("sid_pal_radio_set_tx_power - set pwr: %s%ddB", power > 0 ? "+" : "", power);

    do
    {
        /* Store the currently used value */
        const stm32wlxx_radio_pa_cfg_t current_pa_cfg = drv_ctx.pa_cfg;

        /* Process config update */
        err = radio_stm32wlxx_set_tx_power_config(power);
        if (err != RADIO_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to set STM32WLxx SubGHz Tx power to %ddB. Error %d, state: %u", power, err, drv_ctx.radio_state);
            drv_ctx.pa_cfg = current_pa_cfg; /* restore the state if we've failed to apply the new setting */
            break;
        }
        else
        {
            /* New PA config is stored to drv_ctx.pa_cfg directly by radio_stm32wlxx_set_tx_power_config() */
        }

        /** Always send out PA config even if there's no change. Since dynamic Tx power adjustment was introduced in Sidewalk, Tx power updates may be frequent
         *  and we need to ensure RF timings consistency. To achieve this, it's better to always send out the PA config and account for this SPI transfer delay
         *  on every Tx, rather than dealing with the jitter caused by occasional PA config update frames.
         */
        hal_err = stm32wlxx_hal_set_tx_power(&drv_ctx, &drv_ctx.pa_cfg);
        STM32WLxx_LOG_DEBUG("Updating STM32WLxx Tx power to %s%ddB", drv_ctx.pa_cfg.target_tx_power > 0 ? "+" : "", drv_ctx.pa_cfg.target_tx_power); /* tiny_vsnprintf may not support %+d */

        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to send out new PA config to STM32WLxx. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        err = RADIO_ERROR_NONE;
    } while (0);

    radio_stm32wlxx_error_manager(err, FALSE);
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_sleep(uint32_t sleep_us)
{
    int32_t err;
    stm32wlxx_hal_status_t hal_err;

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
    sid_error_t sid_err;
    struct sid_timespec t_now;

