TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
    sid_err = sid_pal_uptime_now(&t_now);
    __COMPILER_BARRIER();
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

    STM32WLxx_LOG_DEBUG("sid_pal_radio_sleep... Duration: %uus", sleep_us);

    /* Store a copy of the app IRQ mask on entry */
    const uint16_t app_irq_mask = drv_ctx.app_irq_mask;

    do
    {
        /* Skip the request if the radio is in the sleep mode already and this is not a request for indefinite sleep */
        if ((SID_PAL_RADIO_SLEEP == drv_ctx.radio_state) && (sleep_us != 0u))
        {
            STM32WLxx_LOG_DEBUG("SubGHz is already in sleep state, request skipped");
            err = RADIO_ERROR_NONE;
            break;
        }

        /* Workaround for the Sidewalk stack issue for LoRa --------------------------*/
        if (UINT32_MAX == sleep_us)
        {
            /* The stack will first call sid_pal_radio_sleep() with 0xFFFFFFFFu just to stop any potentially running radio operation and after that
             * it will invoke sid_pal_radio_sleep() once again with the actual expected sleep time. To address this we invoke sid_pal_radio_standby()
             * instead for this special case to just stop the possibly running Tx/Rx operation but to still keep the STM32WLxx MCU running and ready
             * to accept the sleep request with the actual sleep duration expectation.
             */
            err = sid_pal_radio_standby();
            break; /* Terminate from here and keep the radio state at SID_PAL_RADIO_STANDBY */
        }
        /*----------------------------------------------------------------------------*/

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
        if ((sleep_us != 0u) && (drv_ctx.modem == STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA) && (sleep_us >= (STM32WLxx_RADIO_LORA_UL_SEPARATION_US - STM32WLxx_RADIO_LORA_RX_TIMEOUT_US)))
        {
            /* Allow UDT only during the first UL slot if Sidewalk link is active. This will prevent collisions between UDT and Tx that can be potentially
             * scheduled by Sidewalk within the current DL separation slot
             */
            sleep_us = STM32WLxx_RADIO_LORA_UL_SEPARATION_US - STM32WLxx_RADIO_LORA_RX_TIMEOUT_US;
        }
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

        /* Mask SubGHz events until the radio reports back it has entered sleep state */
        drv_ctx.app_irq_mask &= ~STM32WLxx_APP_IRQ_SUBGHZ;

        hal_err = stm32wlxx_hal_radio_sleep(&drv_ctx, sleep_us, FALSE);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_LOG_ERROR("Failed to put SubGHz to sleep mode. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

#if (CFG_LPM_LEVEL != 0)
        /* Allow Stop mode after the radio was put into Sleep */
        UTIL_LPM_SetStopMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_ENABLE);
#  if (CFG_LPM_STDBY_SUPPORTED != 0)
        UTIL_LPM_SetOffMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_ENABLE);
#  endif /* CFG_LPM_STDBY_SUPPORTED */
#endif /* (CFG_LPM_LEVEL != 0) */

        drv_ctx.radio_state = SID_PAL_RADIO_SLEEP;
        err = RADIO_ERROR_NONE;

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
        /* Determine if UDT operations can be enabled during the planned sleep period */
        if (0u == sleep_us)
        {
            /* This is a special case - radio is put into Sleep for undefined amount of time (e.g. due to sid_stop() call) */
            drv_ctx.udt_ctx.cut_off_time = SID_TIME_INFINITY;
            __COMPILER_BARRIER();

            /* Allow UDT task to run */
            drv_ctx.udt_ctx.udt_enabled = TRUE;
            __COMPILER_BARRIER();

            /* Notify the UDT task about the transfers are (re-)enabled now */
            const uint32_t flags = osThreadFlagsSet(drv_ctx.udt_ctx.task, STM32WLxx_UDT_TASK_FLAG_UDT_ENABLED);
            SID_PAL_ASSERT((flags & osFlagsError) == 0u); /* Check against systematic failures */
        }
        else if (sleep_us > STM32WLxx_RADIO_CFG_UDT_CUTOFF_TIME_US)
        {
            struct sid_timespec t_sleep;

            /* Check if the current time was obtained successfully on entry to this function */
            if (sid_err != SID_ERROR_NONE)
            {
                SID_PAL_LOG_ERROR("Unable to determine current time. UDT will be skipped");
                break;
            }

            /* Calculate the cut-off timestamp for UDT */
            drv_ctx.udt_ctx.cut_off_time = t_now;
            sid_us_to_timespec((sleep_us - STM32WLxx_RADIO_CFG_UDT_CUTOFF_TIME_US), &t_sleep);
            sid_time_add(&drv_ctx.udt_ctx.cut_off_time, &t_sleep);
            __COMPILER_BARRIER();

            /* Allow UDT task to run */
            drv_ctx.udt_ctx.udt_enabled = TRUE;
            __COMPILER_BARRIER();

            /* Notify the UDT task about the transfers are (re-)enabled now */
            const uint32_t flags = osThreadFlagsSet(drv_ctx.udt_ctx.task, STM32WLxx_UDT_TASK_FLAG_UDT_ENABLED);
            SID_PAL_ASSERT((flags & osFlagsError) == 0u); /* Check against systematic failures */
        }
        else
        {
            /* Not enough time for UDT */
            drv_ctx.udt_ctx.udt_enabled = FALSE;
        }
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */
    } while (0);

    /* Restore the app IRQ mask */
    drv_ctx.app_irq_mask = app_irq_mask;

    radio_stm32wlxx_error_manager(err, TRUE);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_standby(void)
{
    int32_t err;
    stm32wlxx_hal_status_t hal_err;

    /* Store a copy of the app IRQ mask on entry */
    const uint16_t app_irq_mask = drv_ctx.app_irq_mask;

    do
    {
#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
        drv_ctx.udt_ctx.udt_enabled = FALSE;
        __COMPILER_BARRIER();
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

        if (SID_PAL_RADIO_STANDBY == drv_ctx.radio_state)
        {
            STM32WLxx_LOG_DEBUG("SubGHz is already in StandBy state, request skipped");
            err = RADIO_ERROR_NONE;
            break;
        }

#if SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT
        /* Indicate STM32WLxx wakeup start point - keep this code exactly here since all the above lines are always executed, event if there's no need to wake up STM32WLxx */
        __COMPILER_BARRIER();
        if (SID_PAL_RADIO_SLEEP == drv_ctx.radio_state)
        {
            SIDEWALK_RF_TIMINGS_RXTX_START_GPIO_Port->BRR = SIDEWALK_RF_TIMINGS_RXTX_START_Pin;
        }
        __COMPILER_BARRIER();
#endif /* SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT */

        /* Mask SubGHz events until the radio reports back it has entered Standby state */
        drv_ctx.app_irq_mask &= ~STM32WLxx_APP_IRQ_SUBGHZ;

        hal_err = stm32wlxx_hal_radio_standby(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_LOG_ERROR("Failed to put SubGHz to StandBy. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Turn off status LEDs after the radio has reached Standby state */
        stm32wlxx_radio_hal_tx_led_off(&drv_ctx);
        stm32wlxx_radio_hal_rx_led_off(&drv_ctx);
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

        drv_ctx.radio_state = SID_PAL_RADIO_STANDBY;
        err = RADIO_ERROR_NONE;
    } while (0);

#if SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT
    /* Indicate STM32WLxx wakeup done point - keep this code exactly here since all the below lines are always executed, event if there's no need to wake up STM32WLxx */
    __COMPILER_BARRIER();
    SIDEWALK_RF_TIMINGS_RXTX_START_GPIO_Port->BSRR = SIDEWALK_RF_TIMINGS_RXTX_START_Pin;
    __COMPILER_BARRIER();
#endif /* SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT */

