TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
        drv_ctx.radio_state = SID_PAL_RADIO_RX;

#if (CFG_LPM_LEVEL != 0)
        if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == drv_ctx.modem)
        {
            /* Prohibit Stop mode until Rx is done as we need fast response on Rx Done IRQ  */
            UTIL_LPM_SetStopMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
        }
        else
        {
            /* For LoRa link we don't need such rapid response. Additional 200-250us added by the wakeup from Stop LPM won't affect the link performance and we can save some power */
        }
#  if (CFG_LPM_STDBY_SUPPORTED != 0)
        /* Standby LPM is not allowed during active Rx for all radio links */
        UTIL_LPM_SetOffMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
#  endif /* CFG_LPM_STDBY_SUPPORTED */
#endif /* (CFG_LPM_LEVEL != 0) */

#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Drive the status LED after the actual start of Rx to avoid impact on timings */
        stm32wlxx_radio_hal_rx_led_on(&drv_ctx);
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

        err = RADIO_ERROR_NONE;
    } while (0);

    radio_stm32wlxx_error_manager(err, FALSE);
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_is_cad_exit_mode(sid_pal_radio_cad_param_exit_mode_t exit_mode)
{
    int32_t err;

    if ( (exit_mode != SID_PAL_RADIO_CAD_EXIT_MODE_CS_ONLY)
      && (exit_mode != SID_PAL_RADIO_CAD_EXIT_MODE_CS_RX)
      && (exit_mode != SID_PAL_RADIO_CAD_EXIT_MODE_CS_LBT)
      && (exit_mode != SID_PAL_RADIO_CAD_EXIT_MODE_ED_ONLY)
      && (exit_mode != SID_PAL_RADIO_CAD_EXIT_MODE_ED_RX)
      && (exit_mode != SID_PAL_RADIO_CAD_EXIT_MODE_ED_LBT))
    {
        err = RADIO_ERROR_INVALID_PARAMS;
    }
    else
    {
        err = RADIO_ERROR_NONE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_start_carrier_sense(const sid_pal_radio_fsk_cad_params_t * cad_params, sid_pal_radio_cad_param_exit_mode_t exit_mode)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("sid_pal_radio_start_carrier_sense... ");

    do
    {
        /* Validate params */
        err = sid_pal_radio_is_cad_exit_mode(exit_mode);
        if (err != RADIO_ERROR_NONE)
        {
            break;
        }

        /* Initiate CS */
        hal_err = stm32wlxx_hal_radio_start_carrier_sense(&drv_ctx, cad_params, exit_mode);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to start STM32WLxx SubGHz Carrier Sense. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Update driver context */
        drv_ctx.radio_state = SID_PAL_RADIO_RX;
        drv_ctx.cad_exit_mode = exit_mode;
        __COMPILER_BARRIER();

        /* Store the new parameters */
        SID_STM32_UTIL_fast_memcpy(&drv_ctx.applied_fsk_phy_cfg.fsk_cad_params, cad_params, sizeof(drv_ctx.applied_fsk_phy_cfg.fsk_cad_params));

#  if (CFG_LPM_LEVEL != 0)
        /* Prohibit Stop mode until CS is done as we need fast response on the radio IRQs */
        UTIL_LPM_SetStopMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
#    if (CFG_LPM_STDBY_SUPPORTED != 0)
        UTIL_LPM_SetOffMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
#    endif /* CFG_LPM_STDBY_SUPPORTED */
#  endif /* (CFG_LPM_LEVEL != 0) */

#  if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Drive the status LEDs after the actual start of CS to avoid impact on timings */
#    if (HALO_ENABLE_DIAGNOSTICS == 0)
        if (SID_PAL_RADIO_CAD_EXIT_MODE_CS_LBT == exit_mode)
        {
            /* This is carrier sense for FSK Tx */
            stm32wlxx_radio_hal_tx_led_on(&drv_ctx);
        }
        else
#    endif /* HALO_ENABLE_DIAGNOSTICS */
        {
            stm32wlxx_radio_hal_rx_led_on(&drv_ctx);
        }
#  endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

        err = RADIO_ERROR_NONE;
    } while (0);

    radio_stm32wlxx_error_manager(err, FALSE);
    return err;
#else
    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_start_continuous_rx(void)
{
#if HALO_ENABLE_DIAGNOSTICS
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("sid_pal_radio_start_continuous_rx... ");

    do
    {
        hal_err = stm32wlxx_hal_start_continuous_rx(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to start STM32WLxx SubGHz Continuous Rx. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        drv_ctx.radio_state = SID_PAL_RADIO_RX;

#  if (CFG_LPM_LEVEL != 0)
        if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == drv_ctx.modem)
        {
            /* Prohibit Stop mode until Rx is done as we need fast response on Rx Done IRQ */
            UTIL_LPM_SetStopMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
        }
        else
        {
            /* For LoRa link we don't need such rapid response. Additional 200-250us added by the wakeup from Stop LPM won't affect the link performance and we can save some power */
        }
#    if (CFG_LPM_STDBY_SUPPORTED != 0)
        /* Standby LPM is not allowed during active Rx for all radio links */
        UTIL_LPM_SetOffMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
#    endif /* CFG_LPM_STDBY_SUPPORTED */
#  endif /* (CFG_LPM_LEVEL != 0) */

#  if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Drive the status LEDs after the actual start of Rx to avoid impact on timings */
        stm32wlxx_radio_hal_rx_led_on(&drv_ctx);
#  endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

        err = RADIO_ERROR_NONE;
    } while (0);

