TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
    return err;
#else
    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_rx_duty_cycle(uint32_t rx_time, uint32_t sleep_time)
{
#if HALO_ENABLE_DIAGNOSTICS
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("sid_pal_radio_set_rx_duty_cycle... ");

    do
    {
        /* Validate inputs */
        if ((0u == rx_time) || (0u == sleep_time))
        {
            err = RADIO_ERROR_INVALID_PARAMS;
            break;
        }

        hal_err = stm32wlxx_hal_start_rx_duty_cycle(&drv_ctx, rx_time, sleep_time);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to start STM32WLxx SubGHz Rx Duty Cycle. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        drv_ctx.radio_state = SID_PAL_RADIO_RX_DC;

#  if (CFG_LPM_LEVEL != 0)
        if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == drv_ctx.modem)
        {
            /* Prohibit Stop mode until Rx is done as we need fast response on Rx Done IRQ */
            UTIL_LPM_SetStopMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
        }
        else
        {
            /* For LoRa link we don't need such rapid response. Additional 200-250us added by the wakeup from Stop LPM won't affect the link performance and we can save some power */
        }
#    if (CFG_LPM_STDBY_SUPPORTED != 0)
        /* Standby LPM is not allowed during active Rx for all radio links */
        UTIL_LPM_SetOffMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
#    endif /* CFG_LPM_STDBY_SUPPORTED */
#  endif /* (CFG_LPM_LEVEL != 0) */

#  if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Drive the status LEDs after the actual start of Rx to avoid impact on timings */
        stm32wlxx_radio_hal_rx_led_on(&drv_ctx);
#  endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

        err = RADIO_ERROR_NONE;
    } while (0);

    return err;
#else
    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_lora_start_cad(void)
{
#if HALO_ENABLE_DIAGNOSTICS && SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("sid_pal_radio_lora_start_cad... ");

    do
    {
        /* Initiate CAD */
        hal_err = stm32wlxx_hal_radio_start_lora_cad(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to start STM32WLxx SubGHz LoRa CAD. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Update driver context */
        drv_ctx.radio_state   = SID_PAL_RADIO_CAD;
        drv_ctx.cad_exit_mode = drv_ctx.applied_lora_phy_cfg.lora_cad_params.cad_exit_mode;
        __COMPILER_BARRIER();

#  if (CFG_LPM_LEVEL != 0)
        /* Prohibit Stop mode until CAD is done as we need fast response on the radio IRQs */
        UTIL_LPM_SetStopMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
#    if (CFG_LPM_STDBY_SUPPORTED != 0)
        UTIL_LPM_SetOffMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_DISABLE);
#    endif /* CFG_LPM_STDBY_SUPPORTED */
#  endif /* (CFG_LPM_LEVEL != 0) */

#  if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Drive the status LEDs after the actual start of CS to avoid impact on timings */
        if ((SID_PAL_RADIO_CAD_EXIT_MODE_CS_LBT == drv_ctx.cad_exit_mode) || (SID_PAL_RADIO_CAD_EXIT_MODE_ED_LBT == drv_ctx.cad_exit_mode))
        {
            /* This is carrier sense for FSK Tx */
            stm32wlxx_radio_hal_tx_led_on(&drv_ctx);
        }
        else
        {
            stm32wlxx_radio_hal_rx_led_on(&drv_ctx);
        }
#  endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

        err = RADIO_ERROR_NONE;
    } while (0);

    radio_stm32wlxx_error_manager(err, FALSE);
    return err;
#else
    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS && SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int16_t sid_pal_radio_rssi(void)
{
#if HALO_ENABLE_DIAGNOSTICS
    int16_t rssi = INT16_MAX;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_INFO("sid_pal_radio_rssi... ");

    do
    {
        hal_err = stm32wlxx_hal_get_live_rssi(&drv_ctx, &rssi);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to read instant STM32WLxx SubGHz RSSI. HAL error %u", (uint32_t)hal_err);
            break;
        }

        rssi = (int16_t)radio_stm32wlxx_get_adjusted_rssi(rssi);
    } while (0);

    return rssi;
#else
    return INT16_MAX;
#endif /* HALO_ENABLE_DIAGNOSTICS */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_is_channel_free(uint32_t freq, int16_t threshold, uint32_t scan_duration_us, bool * is_channel_free)
{
#if HALO_ENABLE_DIAGNOSTICS
    int32_t err;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("sid_pal_radio_is_channel_free... ");

#  if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Drive the status LEDs after the actual start of Rx to avoid impact on timings */
        stm32wlxx_radio_hal_rx_led_on(&drv_ctx);
#  endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

    do
    {
        /* Adjust threshold by Rx path gain/loss */
        const int32_t rssi_adjustment = (drv_ctx.regional_radio_param->ant_dbi >= 0) ? ((drv_ctx.regional_radio_param->ant_dbi + 50) / 100) : ((drv_ctx.regional_radio_param->ant_dbi - 50) / 100);
        const int16_t adjusted_threshold = (int16_t)((int32_t)threshold + rssi_adjustment);

        hal_err = stm32wlxx_hal_is_channel_free(&drv_ctx, freq, adjusted_threshold, scan_duration_us, is_channel_free);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to check if %uHz channel is free. HAL error %u", freq, (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Done */
        err = RADIO_ERROR_NONE;
    } while (0);

#  if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Drive the status LEDs after the actual start of Rx to avoid impact on timings */
        stm32wlxx_radio_hal_rx_led_off(&drv_ctx);
#  endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

