TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
    return err;
#else
    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_random(uint32_t *random)
{
    SID_PAL_LOG_ERROR("sid_pal_radio_random() is not implemented");
    return RADIO_ERROR_NOT_SUPPORTED;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int16_t sid_pal_radio_get_ant_dbi(void)
{
    SID_PAL_ASSERT(drv_ctx.regional_radio_param != NULL);
    return drv_ctx.regional_radio_param->ant_dbi;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_get_cca_level_adjust(sid_pal_radio_data_rate_t data_rate, int8_t *adj_level)
{
    int32_t err;

    SID_PAL_ASSERT(drv_ctx.regional_radio_param != NULL);

    if ((data_rate <= SID_PAL_RADIO_DATA_RATE_INVALID) || (data_rate > SID_PAL_RADIO_DATA_RATE_MAX_NUM))
    {
        err = RADIO_ERROR_INVALID_PARAMS;
    }
    else
    {
        *adj_level = drv_ctx.regional_radio_param->cca_level_adjust[data_rate - 1];
        err = RADIO_ERROR_NONE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_get_chan_noise(uint32_t freq, int16_t *noise)
{
#if HALO_ENABLE_DIAGNOSTICS
    int32_t err;
    stm32wlxx_hal_status_t hal_err;

    STM32WLxx_LOG_DEBUG("sid_pal_radio_get_chan_noise... ");

#  if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Drive the status LEDs after the actual start of Rx to avoid impact on timings */
        stm32wlxx_radio_hal_rx_led_on(&drv_ctx);
#  endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

    do
    {
        hal_err = stm32wlxx_hal_get_channel_noise(&drv_ctx, freq, noise);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to capture %uHz channel noise. HAL error %u", freq, (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Adjust RSSI */
        *noise = (int16_t)radio_stm32wlxx_get_adjusted_rssi(*noise);

        /* Done */
        err = RADIO_ERROR_NONE;
    } while (0);

#  if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Drive the status LEDs after the actual start of Rx to avoid impact on timings */
        stm32wlxx_radio_hal_rx_led_off(&drv_ctx);
#  endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

    return err;
#else
    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* HALO_ENABLE_DIAGNOSTICS */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_get_radio_state_transition_delays(sid_pal_radio_state_transition_timings_t * state_delay)
{
    static_assert(sizeof(*state_delay) == sizeof(drv_ctx.config->state_timings));
    SID_STM32_UTIL_fast_memcpy(state_delay, &drv_ctx.config->state_timings, sizeof(*state_delay));

    /* While the TCXO is controlled by STM32WLxx, this value shall be aligned with STM32WLxx operation to accommodate the delays caused by TCXO startup */
    state_delay->tcxo_delay_us = STM32WLxx_SUBGHZ_TICKS_TO_US(STM32WLxx_RADIO_COMM_TCXO_TIMEOUT_DURATION_TUS);

    /* Set default wakeup delay if user config does not explicitly specify it */
    if (STM32WLxx_RADIO_CFG_USE_DEFAULT_TIMINGS == state_delay->sleep_to_full_power_us)
    {
        state_delay->sleep_to_full_power_us = STM32WLxx_RADIO_SLEEP_TO_FULL_POWER_DEFAULT_DELAY_US;
    }

    /* Adjust base wake-up time based on the TCXO start time */
    state_delay->sleep_to_full_power_us += state_delay->tcxo_delay_us;

    return RADIO_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_init(sid_pal_radio_event_notify_t notify, sid_pal_radio_irq_handler_t dio_irq_handler, sid_pal_radio_rx_packet_t *rx_packet)
{
    int32_t err = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t hal_err;
    int8_t tx_power;

    SID_PAL_LOG_DEBUG("sid_pal_radio_init... ");
    do
    {
        /* Validate the inputs -------------------------------------------------------*/
        if ((NULL == notify) || (NULL == dio_irq_handler) || (NULL == rx_packet))
        {
            STM32WLxx_LOG_ERROR("sid_pal_radio_init() aborted due to invalid input parameters");
            err = RADIO_ERROR_INVALID_PARAMS;
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Check if the driver is initialized already */
        if (drv_ctx.init_done != FALSE)
        {
            SID_PAL_LOG_WARNING("STM32WLxx driver is initialized already. Requesting deinitialization");

            /* Deinitialize any hardware that may have been partially initialized to bring it to the known state */
            err = sid_pal_radio_deinit();
            if (err != RADIO_ERROR_NONE)
            {
                SID_PAL_LOG_ERROR("Unable to initialize STM32WLxx radio - driver is initialized already and deinitialization failed. Error %d", err);
                break;
            }
        }
        /*----------------------------------------------------------------------------*/

        /* Ensure STM32WLxx won't trigger any interrupt if we are re-initializing ----*/
        hal_err = stm32wlxx_hal_disarm_irq(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            /* Logs are provided by the stm32wlxx_hal_disarm_irq() */
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }
        __COMPILER_BARRIER(); /* Ensure IRQ is disarmed right now before any further actions take place */
        /*----------------------------------------------------------------------------*/

        /* Initialize variables, statuses, etc. --------------------------------------*/
        /* Create a binary semaphore to wait for Request Completed IRQ when required */
        SID_PAL_ASSERT(NULL == drv_ctx.req_completed_wait_lock);
        drv_ctx.req_completed_wait_lock = osSemaphoreNew(1u, 1u, &wlxx_request_ack_lock_attributes);

        /* Check iof the semaphore was actually created */
        if (NULL == drv_ctx.req_completed_wait_lock)
        {
            SID_PAL_LOG_ERROR("Failed to create semaphore for Request Processed IRQ handling");
            err = RADIO_ERROR_NOMEM;
            break;
        }
        /*----------------------------------------------------------------------------*/

