TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
        /* Create a binary semaphore to wait for a generic IRQ indication when required */
        SID_PAL_ASSERT(NULL == drv_ctx.irq_detected_wait_lock);
        drv_ctx.irq_detected_wait_lock = osSemaphoreNew(1u, 0u, &wlxx_irq_wait_lock_attributes);

        /* Check iof the semaphore was actually created */
        if (NULL == drv_ctx.irq_detected_wait_lock)
        {
            SID_PAL_LOG_ERROR("Failed to create semaphore for IRQ detection handling");
            err = RADIO_ERROR_NOMEM;
            break;
        }
        /*----------------------------------------------------------------------------*/

#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
        /* Initialize User Data Transfer service -------------------------------------*/
        /* Create UDT message queue */
        if (NULL == drv_ctx.udt_ctx.outbound_msg_queue)
        {
            drv_ctx.udt_ctx.outbound_msg_queue = osMessageQueueNew(STM32WLxx_RADIO_CFG_UDT_OB_MSG_QUEUE_LEN, sizeof(stm32wlxx_ext_ifc_out_msg_desc_t), NULL);
            if (NULL == drv_ctx.udt_ctx.outbound_msg_queue)
            {
                SID_PAL_LOG_ERROR("Can't create UDT message queue. No memory");
                err = RADIO_ERROR_NOMEM;
                break;
            }
        }

        /* Create the task that will handle the UDT */
        if (NULL == drv_ctx.udt_ctx.task)
        {
            drv_ctx.udt_ctx.task = osThreadNew(_user_data_transfer_thread, NULL, &wlxx_user_data_transfer_thread_attributes);
            if (NULL == drv_ctx.udt_ctx.task)
            {
                SID_PAL_LOG_ERROR("Can't create UDT processing thread. No memory");
                err = RADIO_ERROR_NOMEM;
                break;
            }
        }
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

        /* Configure driver context with the supplied parameters */
        drv_ctx.radio_rx_packet      = rx_packet;
        drv_ctx.report_radio_event   = notify;
        drv_ctx.irq_handler          = dio_irq_handler;

#if ((SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 != 0) && (SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 == 0))
        /* FSK-only SubGHz link, default to FSK modem mode for initialization */
        drv_ctx.modem                = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK;
        drv_ctx.subghz_irq_mask      = STM32WLxx_RADIO_COMM_DEFAULT_FSK_IRQ_MASK;
#else
        /* LoRa-only or FSK-LoRa SubGHz link - default to LoRa modem mode for initialization */
        drv_ctx.modem                = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA;
        drv_ctx.subghz_irq_mask      = STM32WLxx_RADIO_COMM_DEFAULT_LORA_IRQ_MASK;
#endif

        /* Store the selected region the in driver context. It won't be sent to the STM32WLxx immediately */
        err = sid_pal_radio_set_region(drv_ctx.config->regional_config.radio_region);
        if (err != RADIO_ERROR_NONE)
        {
            STM32WLxx_LOG_ERROR("sid_pal_radio_set_region() failed with error %d", err);
            break;
        }

        /* At this point the SubGHz radio and the entire STM32WLxx MCU may be in any state (e.g. in LPM Sleep or Stop) */
        drv_ctx.radio_state = SID_PAL_RADIO_UNKNOWN;
        /*----------------------------------------------------------------------------*/

        /* Initialize the underlying hardware ----------------------------------------*/
        err = radio_stm32wlxx_platform_init();
        if (err != RADIO_ERROR_NONE)
        {
            STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_init() failed with error %d", err);
            break;
        }

        /* Perform multiple attempts of handshaking with the STM32WLxx ---------------*/
        uint32_t handshake_attempts_counter = 0u;
        do
        {
            handshake_attempts_counter++;

            err = radio_stm32wlxx_do_handshake();
            if ((RADIO_ERROR_NONE == err) || (RADIO_ERROR_NOT_SUPPORTED == err))
            {
                /* Exit either on success or unrecoverable error */
                break;
            }
        } while (handshake_attempts_counter < STM32WLxx_HANDSHAKE_ATTEMPTS_LIMIT);

        /* Check if Handshake procedure succeeded */
        if (err != RADIO_ERROR_NONE)
        {
            STM32WLxx_LOG_ERROR("radio_stm32wlxx_do_handshake() failed with error %d", err);
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Now configure STM32WLxx IRQ line in as a regular IRQ line -----------------*/
        hal_err = stm32wlxx_hal_arm_irq(&drv_ctx);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            /* Logs are provided by the stm32wlxx_hal_arm_irq() */
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Enable STM32WLxx Sidewalk Radio App-level IRQs */
        drv_ctx.app_irq_mask = STM32WLxx_ALL_APP_IRQ_MASK;
        /*----------------------------------------------------------------------------*/

        /* Ensure STM32WLxx's SubGHz radio is in Standby -----------------------------*/
        err = sid_pal_radio_standby();
        if (err != RADIO_ERROR_NONE)
        {
            STM32WLxx_LOG_ERROR("sid_pal_radio_standby() failed with error %d", err);
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Setup power amplifier config values - not sent immediately ----------------*/
        err = sid_pal_radio_get_max_tx_power(SID_PAL_RADIO_DATA_RATE_50KBPS, &tx_power);
        if (err != RADIO_ERROR_NONE)
        {
            STM32WLxx_LOG_ERROR("sid_pal_radio_get_max_tx_power() failed with error code %d", err);
            break;
        }
        err = radio_stm32wlxx_set_tx_power_config(tx_power);
        if (err != RADIO_ERROR_NONE)
        {
            STM32WLxx_LOG_ERROR("radio_stm32wlxx_set_tx_power_config() failed with error code %d", err);
            break;
        }
        /*----------------------------------------------------------------------------*/

