TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio.c
        /* Send out SubGHz radio configuration via SPI to STM32WLxx ------------------*/
        err = stm32wlxx_radio_send_subghz_config(TRUE, TRUE);
        if (err != RADIO_ERROR_NONE)
        {
            /* Logs are provided by stm32wlxx_radio_send_subghz_config() */
            break;
        }

        /* Perform the final STM32WLxx Sidewalk Radio App initialization steps */
        hal_err = stm32wlxx_hal_apply_base_hw_config(&drv_ctx, TRUE);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to apply essential SubGHz HW config. Error code %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* STM32WLxx puts SubGHz radio back to Standby mode after HW init */

        /* Explicitly set modem mode on the remote side */
        hal_err = stm32wlxx_hal_radio_set_modem_mode(&drv_ctx, drv_ctx.modem);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to set SubGHz modem mode. Error code %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Initialization sequence is finished with no issues */
        err = RADIO_ERROR_NONE;
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Unable to initialize STM32WLxx radio. Error %d", err);

        /* Ensure we deinitialize any hardware that may have been partially initialized */
        (void)sid_pal_radio_deinit();
    }
    else
    {
        drv_ctx.init_done = TRUE;
#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
        /* Ensure drv_ctx.init_done is set to TRUE before interacting with the UDT task */
        __COMPILER_BARRIER();

        /* Notify the UDT task about the driver readiness */
        const uint32_t flags = osThreadFlagsSet(drv_ctx.udt_ctx.task, STM32WLxx_UDT_TASK_FLAG_INIT_DONE);
        SID_PAL_ASSERT((flags & osFlagsError) == 0u); /* Check against systematic failures */
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */
        SID_PAL_LOG_INFO("STM32WLxx radio initialized");
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_deinit(void)
{
    int32_t err = RADIO_ERROR_GENERIC;
    osStatus_t os_err;

    SID_PAL_LOG_DEBUG("sid_pal_radio_deinit... ");

    do
    {
#if STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER
        drv_ctx.udt_ctx.udt_enabled = FALSE;
        __COMPILER_BARRIER();

        /**
         * Important note: not killing the UDT task and message queue here to allow retention of any unprocessed UDT messages.
         * These messages will be delivered to the STM32WLxx side upon the next time the radio driver is initialized.Termnating
         * the UDT task may result in the loss of a single message that was already popped out of the queue but not sent yet.
         * Destroying the message queue will result in the total loss of all non-delivered messages.
         */
#endif /* STM32WLXX_EXT_IFC_ENABLE_USER_DATA_TRANSFER */

        /* Bring down the underlying hardware */
        err = radio_stm32wlxx_platform_deinit();
        if (err != RADIO_ERROR_NONE)
        {
            STM32WLxx_LOG_ERROR("radio_stm32wlxx_platform_deinit() failed. Error %d", err);
            break;
        }

        /* From here radio IRQs won't be processed */

        /* Delete the Request Completed lock */
        os_err = osSemaphoreDelete(drv_ctx.req_completed_wait_lock);
        SID_PAL_ASSERT(osOK == os_err); /* osSemaphoreDelete() can fail only on systematic issues, so assertion is better and more efficient here */
        drv_ctx.req_completed_wait_lock = NULL;

        /* Delete the IRQ Detection lock */
        os_err = osSemaphoreDelete(drv_ctx.irq_detected_wait_lock);
        SID_PAL_ASSERT(osOK == os_err); /* osSemaphoreDelete() can fail only on systematic issues, so assertion is better and more efficient here */
        drv_ctx.irq_detected_wait_lock = NULL;

        /* Invalidate the context */
        drv_ctx.init_done            = FALSE;
        drv_ctx.irq_enabled          = FALSE;
        drv_ctx.app_irq_mask         = STM32WLxx_APP_IRQ_NONE;
        drv_ctx.subghz_irq_mask      = STM32WLxx_SUBGHZ_IRQ_NONE;
        drv_ctx.req_with_ack_ongoing = FALSE;
        drv_ctx.modem                = STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_UNDEFINED;
        drv_ctx.radio_rx_packet      = NULL;
        drv_ctx.radio_freq_hz        = 0u;
        drv_ctx.radio_state          = SID_PAL_RADIO_UNKNOWN;
        SID_STM32_UTIL_fast_memset(&drv_ctx.last_irq_status,      0u, sizeof(drv_ctx.last_irq_status));
        SID_STM32_UTIL_fast_memset(&drv_ctx.error_monitor,        0u, sizeof(drv_ctx.error_monitor));

#if STM32WLxx_RADIO_APP_LPM_SUPPORT
        drv_ctx.ldt_ongoing          = FALSE;
#endif /* STM32WLxx_RADIO_APP_LPM_SUPPORT */

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
        SID_STM32_UTIL_fast_memset(&drv_ctx.applied_fsk_phy_cfg,  0u, sizeof(drv_ctx.applied_fsk_phy_cfg));
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
        SID_STM32_UTIL_fast_memset(&drv_ctx.applied_lora_phy_cfg, 0u, sizeof(drv_ctx.applied_lora_phy_cfg));
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Unable to deinitialize STM32WLxx radio. Error %d", err);
    }
    else
    {
        SID_PAL_LOG_INFO("STM32WLxx radio deinitialized");
    }

#if (CFG_LPM_LEVEL != 0)
    /* Allow Stop mode after the radio driver is deinitialized */
    UTIL_LPM_SetStopMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_ENABLE);
#  if (CFG_LPM_STDBY_SUPPORTED != 0)
    UTIL_LPM_SetOffMode((1u << CFG_LPM_SIDEWALK), UTIL_LPM_ENABLE);
#  endif /* CFG_LPM_STDBY_SUPPORTED */
#endif /* (CFG_LPM_LEVEL != 0) */

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED void sid_pal_radio_notify_host_standby_exit(void)
{
    stm32wlxx_hal_status_t hal_err;

    (void)hal_err;

    /* Important note: this method is typically called in the context of system wakeup from Standby LPM, so available stack size is quite limited. Try to avoid printing logs from here or calling any stack-heavy functions */

    do
    {
        if (NULL == drv_ctx.config)
        {
            /* Radio is not initialized yet, GPIO config is not available */
            break;
        }

        if (drv_ctx.init_done != FALSE)
        {
            /* Restore GPIO pins configuration */
            hal_err = stm32wlxx_radio_hal_init_gpio(&drv_ctx);
            SID_PAL_ASSERT(STM32WLxx_HAL_STATUS_OK == hal_err);

            /* SPI bus re-initialization is performed by SPI driver independently. No actions required here */
        }
        else
        {
            /* Radio is not used, ensure GPIO pins are configured to keep SX126x off */
            hal_err = stm32wlxx_radio_hal_deinit_gpio(&drv_ctx);
            SID_PAL_ASSERT(STM32WLxx_HAL_STATUS_OK == hal_err);
        }
    } while (0);
}

/*----------------------------------------------------------------------------*/

#if SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT
SID_STM32_SPEED_OPTIMIZED void sid_pal_radio_rxtx_start_cb(void)
{
    /* Keep this function as short as possible to minimize its contribution to the Rx/Tx processing delays */
    SIDEWALK_RF_TIMINGS_RXTX_START_GPIO_Port->BSRR = SIDEWALK_RF_TIMINGS_RXTX_START_Pin;
}
#endif /* SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT */
